MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4108-Q48K64/mcu.h
/* ----------------------------  SCU_HIBERNATE_HINTST  ---------------------------- */
#define SCU_HIBERNATE_HINTST_HIBNINT_Pos      (0UL)                     /*!< SCU_HIBERNATE HINTST: HIBNINT (Bit 0)                       */
#define SCU_HIBERNATE_HINTST_HIBNINT_Msk      (0x1UL)                   /*!< SCU_HIBERNATE HINTST: HIBNINT (Bitfield-Mask: 0x01)         */
#define SCU_HIBERNATE_HINTST_FLASHOFF_Pos     (2UL)                     /*!< SCU_HIBERNATE HINTST: FLASHOFF (Bit 2)                      */
#define SCU_HIBERNATE_HINTST_FLASHOFF_Msk     (0x4UL)                   /*!< SCU_HIBERNATE HINTST: FLASHOFF (Bitfield-Mask: 0x01)        */
#define SCU_HIBERNATE_HINTST_FLASHPD_Pos      (3UL)                     /*!< SCU_HIBERNATE HINTST: FLASHPD (Bit 3)                       */
#define SCU_HIBERNATE_HINTST_FLASHPD_Msk      (0x8UL)                   /*!< SCU_HIBERNATE HINTST: FLASHPD (Bitfield-Mask: 0x01)         */
#define SCU_HIBERNATE_HINTST_POFFD_Pos        (4UL)                     /*!< SCU_HIBERNATE HINTST: POFFD (Bit 4)                         */
#define SCU_HIBERNATE_HINTST_POFFD_Msk        (0x10UL)                  /*!< SCU_HIBERNATE HINTST: POFFD (Bitfield-Mask: 0x01)           */
#define SCU_HIBERNATE_HINTST_PPODEL_Pos       (16UL)                    /*!< SCU_HIBERNATE HINTST: PPODEL (Bit 16)                       */
#define SCU_HIBERNATE_HINTST_PPODEL_Msk       (0x30000UL)               /*!< SCU_HIBERNATE HINTST: PPODEL (Bitfield-Mask: 0x03)          */
#define SCU_HIBERNATE_HINTST_POFFH_Pos        (20UL)                    /*!< SCU_HIBERNATE HINTST: POFFH (Bit 20)                        */
#define SCU_HIBERNATE_HINTST_POFFH_Msk        (0x100000UL)              /*!< SCU_HIBERNATE HINTST: POFFH (Bitfield-Mask: 0x01)           */

/* ----------------------------  SCU_HIBERNATE_HINTCLR  --------------------------- */
#define SCU_HIBERNATE_HINTCLR_HIBNINT_Pos     (0UL)                     /*!< SCU_HIBERNATE HINTCLR: HIBNINT (Bit 0)                      */
#define SCU_HIBERNATE_HINTCLR_HIBNINT_Msk     (0x1UL)                   /*!< SCU_HIBERNATE HINTCLR: HIBNINT (Bitfield-Mask: 0x01)        */
#define SCU_HIBERNATE_HINTCLR_FLASHOFF_Pos    (2UL)                     /*!< SCU_HIBERNATE HINTCLR: FLASHOFF (Bit 2)                     */
#define SCU_HIBERNATE_HINTCLR_FLASHOFF_Msk    (0x4UL)                   /*!< SCU_HIBERNATE HINTCLR: FLASHOFF (Bitfield-Mask: 0x01)       */
#define SCU_HIBERNATE_HINTCLR_FLASHPD_Pos     (3UL)                     /*!< SCU_HIBERNATE HINTCLR: FLASHPD (Bit 3)                      */
#define SCU_HIBERNATE_HINTCLR_FLASHPD_Msk     (0x8UL)                   /*!< SCU_HIBERNATE HINTCLR: FLASHPD (Bitfield-Mask: 0x01)        */
#define SCU_HIBERNATE_HINTCLR_POFFD_Pos       (4UL)                     /*!< SCU_HIBERNATE HINTCLR: POFFD (Bit 4)                        */
#define SCU_HIBERNATE_HINTCLR_POFFD_Msk       (0x10UL)                  /*!< SCU_HIBERNATE HINTCLR: POFFD (Bitfield-Mask: 0x01)          */
#define SCU_HIBERNATE_HINTCLR_PPODEL_Pos      (16UL)                    /*!< SCU_HIBERNATE HINTCLR: PPODEL (Bit 16)                      */
#define SCU_HIBERNATE_HINTCLR_PPODEL_Msk      (0x30000UL)               /*!< SCU_HIBERNATE HINTCLR: PPODEL (Bitfield-Mask: 0x03)         */
#define SCU_HIBERNATE_HINTCLR_POFFH_Pos       (20UL)                    /*!< SCU_HIBERNATE HINTCLR: POFFH (Bit 20)                       */
#define SCU_HIBERNATE_HINTCLR_POFFH_Msk       (0x100000UL)              /*!< SCU_HIBERNATE HINTCLR: POFFH (Bitfield-Mask: 0x01)          */

/* ----------------------------  SCU_HIBERNATE_HINTSET  --------------------------- */
#define SCU_HIBERNATE_HINTSET_HIBNINT_Pos     (0UL)                     /*!< SCU_HIBERNATE HINTSET: HIBNINT (Bit 0)                      */
#define SCU_HIBERNATE_HINTSET_HIBNINT_Msk     (0x1UL)                   /*!< SCU_HIBERNATE HINTSET: HIBNINT (Bitfield-Mask: 0x01)        */
#define SCU_HIBERNATE_HINTSET_VCOREOFF_Pos    (1UL)                     /*!< SCU_HIBERNATE HINTSET: VCOREOFF (Bit 1)                     */
#define SCU_HIBERNATE_HINTSET_VCOREOFF_Msk    (0x2UL)                   /*!< SCU_HIBERNATE HINTSET: VCOREOFF (Bitfield-Mask: 0x01)       */
#define SCU_HIBERNATE_HINTSET_FLASHOFF_Pos    (2UL)                     /*!< SCU_HIBERNATE HINTSET: FLASHOFF (Bit 2)                     */
#define SCU_HIBERNATE_HINTSET_FLASHOFF_Msk    (0x4UL)                   /*!< SCU_HIBERNATE HINTSET: FLASHOFF (Bitfield-Mask: 0x01)       */
#define SCU_HIBERNATE_HINTSET_FLASHPD_Pos     (3UL)                     /*!< SCU_HIBERNATE HINTSET: FLASHPD (Bit 3)                      */
#define SCU_HIBERNATE_HINTSET_FLASHPD_Msk     (0x8UL)                   /*!< SCU_HIBERNATE HINTSET: FLASHPD (Bitfield-Mask: 0x01)        */
#define SCU_HIBERNATE_HINTSET_POFFD_Pos       (4UL)                     /*!< SCU_HIBERNATE HINTSET: POFFD (Bit 4)                        */
#define SCU_HIBERNATE_HINTSET_POFFD_Msk       (0x10UL)                  /*!< SCU_HIBERNATE HINTSET: POFFD (Bitfield-Mask: 0x01)          */
#define SCU_HIBERNATE_HINTSET_PPODEL_Pos      (16UL)                    /*!< SCU_HIBERNATE HINTSET: PPODEL (Bit 16)                      */
#define SCU_HIBERNATE_HINTSET_PPODEL_Msk      (0x30000UL)               /*!< SCU_HIBERNATE HINTSET: PPODEL (Bitfield-Mask: 0x03)         */
#define SCU_HIBERNATE_HINTSET_POFFH_Pos       (20UL)                    /*!< SCU_HIBERNATE HINTSET: POFFH (Bit 20)                       */
#define SCU_HIBERNATE_HINTSET_POFFH_Msk       (0x100000UL)              /*!< SCU_HIBERNATE HINTSET: POFFH (Bitfield-Mask: 0x01)          */


/* ================================================================================ */
/* ================       struct 'SCU_POWER' Position & Mask       ================ */
/* ================================================================================ */


/* ------------------------------  SCU_POWER_PWRSTAT  ----------------------------- */
#define SCU_POWER_PWRSTAT_HIBEN_Pos           (0UL)                     /*!< SCU_POWER PWRSTAT: HIBEN (Bit 0)                            */
#define SCU_POWER_PWRSTAT_HIBEN_Msk           (0x1UL)                   /*!< SCU_POWER PWRSTAT: HIBEN (Bitfield-Mask: 0x01)              */
#define SCU_POWER_PWRSTAT_USBPHYPDQ_Pos       (16UL)                    /*!< SCU_POWER PWRSTAT: USBPHYPDQ (Bit 16)                       */
#define SCU_POWER_PWRSTAT_USBPHYPDQ_Msk       (0x10000UL)               /*!< SCU_POWER PWRSTAT: USBPHYPDQ (Bitfield-Mask: 0x01)          */
#define SCU_POWER_PWRSTAT_USBPUWQ_Pos         (18UL)                    /*!< SCU_POWER PWRSTAT: USBPUWQ (Bit 18)                         */
#define SCU_POWER_PWRSTAT_USBPUWQ_Msk         (0x40000UL)               /*!< SCU_POWER PWRSTAT: USBPUWQ (Bitfield-Mask: 0x01)            */

/* ------------------------------  SCU_POWER_PWRSET  ------------------------------ */
#define SCU_POWER_PWRSET_HIB_Pos              (0UL)                     /*!< SCU_POWER PWRSET: HIB (Bit 0)                               */
#define SCU_POWER_PWRSET_HIB_Msk              (0x1UL)                   /*!< SCU_POWER PWRSET: HIB (Bitfield-Mask: 0x01)                 */
#define SCU_POWER_PWRSET_USBPHYPDQ_Pos        (16UL)                    /*!< SCU_POWER PWRSET: USBPHYPDQ (Bit 16)                        */
#define SCU_POWER_PWRSET_USBPHYPDQ_Msk        (0x10000UL)               /*!< SCU_POWER PWRSET: USBPHYPDQ (Bitfield-Mask: 0x01)           */
#define SCU_POWER_PWRSET_USBPUWQ_Pos          (18UL)                    /*!< SCU_POWER PWRSET: USBPUWQ (Bit 18)                          */
#define SCU_POWER_PWRSET_USBPUWQ_Msk          (0x40000UL)               /*!< SCU_POWER PWRSET: USBPUWQ (Bitfield-Mask: 0x01)             */

/* ------------------------------  SCU_POWER_PWRCLR  ------------------------------ */
#define SCU_POWER_PWRCLR_HIB_Pos              (0UL)                     /*!< SCU_POWER PWRCLR: HIB (Bit 0)                               */
#define SCU_POWER_PWRCLR_HIB_Msk              (0x1UL)                   /*!< SCU_POWER PWRCLR: HIB (Bitfield-Mask: 0x01)                 */
#define SCU_POWER_PWRCLR_USBPHYPDQ_Pos        (16UL)                    /*!< SCU_POWER PWRCLR: USBPHYPDQ (Bit 16)                        */
#define SCU_POWER_PWRCLR_USBPHYPDQ_Msk        (0x10000UL)               /*!< SCU_POWER PWRCLR: USBPHYPDQ (Bitfield-Mask: 0x01)           */
#define SCU_POWER_PWRCLR_USBPUWQ_Pos          (18UL)                    /*!< SCU_POWER PWRCLR: USBPUWQ (Bit 18)                          */
#define SCU_POWER_PWRCLR_USBPUWQ_Msk          (0x40000UL)               /*!< SCU_POWER PWRCLR: USBPUWQ (Bitfield-Mask: 0x01)             */

/* ------------------------------  SCU_POWER_EVRSTAT  ----------------------------- */
#define SCU_POWER_EVRSTAT_OV13_Pos            (1UL)                     /*!< SCU_POWER EVRSTAT: OV13 (Bit 1)                             */
#define SCU_POWER_EVRSTAT_OV13_Msk            (0x2UL)                   /*!< SCU_POWER EVRSTAT: OV13 (Bitfield-Mask: 0x01)               */

/* ----------------------------  SCU_POWER_EVRVADCSTAT  --------------------------- */
#define SCU_POWER_EVRVADCSTAT_VADC13V_Pos     (0UL)                     /*!< SCU_POWER EVRVADCSTAT: VADC13V (Bit 0)                      */
#define SCU_POWER_EVRVADCSTAT_VADC13V_Msk     (0xffUL)                  /*!< SCU_POWER EVRVADCSTAT: VADC13V (Bitfield-Mask: 0xff)        */
#define SCU_POWER_EVRVADCSTAT_VADC33V_Pos     (8UL)                     /*!< SCU_POWER EVRVADCSTAT: VADC33V (Bit 8)                      */
#define SCU_POWER_EVRVADCSTAT_VADC33V_Msk     (0xff00UL)                /*!< SCU_POWER EVRVADCSTAT: VADC33V (Bitfield-Mask: 0xff)        */

/* ------------------------------  SCU_POWER_PWRMON  ------------------------------ */
#define SCU_POWER_PWRMON_THRS_Pos             (0UL)                     /*!< SCU_POWER PWRMON: THRS (Bit 0)                              */
#define SCU_POWER_PWRMON_THRS_Msk             (0xffUL)                  /*!< SCU_POWER PWRMON: THRS (Bitfield-Mask: 0xff)                */
#define SCU_POWER_PWRMON_INTV_Pos             (8UL)                     /*!< SCU_POWER PWRMON: INTV (Bit 8)                              */
#define SCU_POWER_PWRMON_INTV_Msk             (0xff00UL)                /*!< SCU_POWER PWRMON: INTV (Bitfield-Mask: 0xff)                */
#define SCU_POWER_PWRMON_ENB_Pos              (16UL)                    /*!< SCU_POWER PWRMON: ENB (Bit 16)                              */
#define SCU_POWER_PWRMON_ENB_Msk              (0x10000UL)               /*!< SCU_POWER PWRMON: ENB (Bitfield-Mask: 0x01)                 */


/* ================================================================================ */
/* ================       struct 'SCU_RESET' Position & Mask       ================ */
/* ================================================================================ */


/* ------------------------------  SCU_RESET_RSTSTAT  ----------------------------- */
#define SCU_RESET_RSTSTAT_RSTSTAT_Pos         (0UL)                     /*!< SCU_RESET RSTSTAT: RSTSTAT (Bit 0)                          */
#define SCU_RESET_RSTSTAT_RSTSTAT_Msk         (0xffUL)                  /*!< SCU_RESET RSTSTAT: RSTSTAT (Bitfield-Mask: 0xff)            */
#define SCU_RESET_RSTSTAT_HIBWK_Pos           (8UL)                     /*!< SCU_RESET RSTSTAT: HIBWK (Bit 8)                            */
#define SCU_RESET_RSTSTAT_HIBWK_Msk           (0x100UL)                 /*!< SCU_RESET RSTSTAT: HIBWK (Bitfield-Mask: 0x01)              */
#define SCU_RESET_RSTSTAT_HIBRS_Pos           (9UL)                     /*!< SCU_RESET RSTSTAT: HIBRS (Bit 9)                            */
#define SCU_RESET_RSTSTAT_HIBRS_Msk           (0x200UL)                 /*!< SCU_RESET RSTSTAT: HIBRS (Bitfield-Mask: 0x01)              */
#define SCU_RESET_RSTSTAT_LCKEN_Pos           (10UL)                    /*!< SCU_RESET RSTSTAT: LCKEN (Bit 10)                           */
#define SCU_RESET_RSTSTAT_LCKEN_Msk           (0x400UL)                 /*!< SCU_RESET RSTSTAT: LCKEN (Bitfield-Mask: 0x01)              */

/* ------------------------------  SCU_RESET_RSTSET  ------------------------------ */
#define SCU_RESET_RSTSET_HIBWK_Pos            (8UL)                     /*!< SCU_RESET RSTSET: HIBWK (Bit 8)                             */
#define SCU_RESET_RSTSET_HIBWK_Msk            (0x100UL)                 /*!< SCU_RESET RSTSET: HIBWK (Bitfield-Mask: 0x01)               */
#define SCU_RESET_RSTSET_HIBRS_Pos            (9UL)                     /*!< SCU_RESET RSTSET: HIBRS (Bit 9)                             */
#define SCU_RESET_RSTSET_HIBRS_Msk            (0x200UL)                 /*!< SCU_RESET RSTSET: HIBRS (Bitfield-Mask: 0x01)               */
#define SCU_RESET_RSTSET_LCKEN_Pos            (10UL)                    /*!< SCU_RESET RSTSET: LCKEN (Bit 10)                            */
#define SCU_RESET_RSTSET_LCKEN_Msk            (0x400UL)                 /*!< SCU_RESET RSTSET: LCKEN (Bitfield-Mask: 0x01)               */

/* ------------------------------  SCU_RESET_RSTCLR  ------------------------------ */
#define SCU_RESET_RSTCLR_RSCLR_Pos            (0UL)                     /*!< SCU_RESET RSTCLR: RSCLR (Bit 0)                             */
#define SCU_RESET_RSTCLR_RSCLR_Msk            (0x1UL)                   /*!< SCU_RESET RSTCLR: RSCLR (Bitfield-Mask: 0x01)               */
#define SCU_RESET_RSTCLR_HIBWK_Pos            (8UL)                     /*!< SCU_RESET RSTCLR: HIBWK (Bit 8)                             */
#define SCU_RESET_RSTCLR_HIBWK_Msk            (0x100UL)                 /*!< SCU_RESET RSTCLR: HIBWK (Bitfield-Mask: 0x01)               */
#define SCU_RESET_RSTCLR_HIBRS_Pos            (9UL)                     /*!< SCU_RESET RSTCLR: HIBRS (Bit 9)                             */
#define SCU_RESET_RSTCLR_HIBRS_Msk            (0x200UL)                 /*!< SCU_RESET RSTCLR: HIBRS (Bitfield-Mask: 0x01)               */
#define SCU_RESET_RSTCLR_LCKEN_Pos            (10UL)                    /*!< SCU_RESET RSTCLR: LCKEN (Bit 10)                            */
#define SCU_RESET_RSTCLR_LCKEN_Msk            (0x400UL)                 /*!< SCU_RESET RSTCLR: LCKEN (Bitfield-Mask: 0x01)               */

/* ------------------------------  SCU_RESET_PRSTAT0  ----------------------------- */
#define SCU_RESET_PRSTAT0_VADCRS_Pos          (0UL)                     /*!< SCU_RESET PRSTAT0: VADCRS (Bit 0)                           */
#define SCU_RESET_PRSTAT0_VADCRS_Msk          (0x1UL)                   /*!< SCU_RESET PRSTAT0: VADCRS (Bitfield-Mask: 0x01)             */
#define SCU_RESET_PRSTAT0_CCU40RS_Pos         (2UL)                     /*!< SCU_RESET PRSTAT0: CCU40RS (Bit 2)                          */
#define SCU_RESET_PRSTAT0_CCU40RS_Msk         (0x4UL)                   /*!< SCU_RESET PRSTAT0: CCU40RS (Bitfield-Mask: 0x01)            */
#define SCU_RESET_PRSTAT0_CCU41RS_Pos         (3UL)                     /*!< SCU_RESET PRSTAT0: CCU41RS (Bit 3)                          */
#define SCU_RESET_PRSTAT0_CCU41RS_Msk         (0x8UL)                   /*!< SCU_RESET PRSTAT0: CCU41RS (Bitfield-Mask: 0x01)            */
#define SCU_RESET_PRSTAT0_CCU80RS_Pos         (7UL)                     /*!< SCU_RESET PRSTAT0: CCU80RS (Bit 7)                          */
#define SCU_RESET_PRSTAT0_CCU80RS_Msk         (0x80UL)                  /*!< SCU_RESET PRSTAT0: CCU80RS (Bitfield-Mask: 0x01)            */
#define SCU_RESET_PRSTAT0_POSIF0RS_Pos        (9UL)                     /*!< SCU_RESET PRSTAT0: POSIF0RS (Bit 9)                         */
#define SCU_RESET_PRSTAT0_POSIF0RS_Msk        (0x200UL)                 /*!< SCU_RESET PRSTAT0: POSIF0RS (Bitfield-Mask: 0x01)           */
#define SCU_RESET_PRSTAT0_USIC0RS_Pos         (11UL)                    /*!< SCU_RESET PRSTAT0: USIC0RS (Bit 11)                         */
#define SCU_RESET_PRSTAT0_USIC0RS_Msk         (0x800UL)                 /*!< SCU_RESET PRSTAT0: USIC0RS (Bitfield-Mask: 0x01)            */
#define SCU_RESET_PRSTAT0_ERU1RS_Pos          (16UL)                    /*!< SCU_RESET PRSTAT0: ERU1RS (Bit 16)                          */
#define SCU_RESET_PRSTAT0_ERU1RS_Msk          (0x10000UL)               /*!< SCU_RESET PRSTAT0: ERU1RS (Bitfield-Mask: 0x01)             */
#define SCU_RESET_PRSTAT0_HRPWM0RS_Pos        (23UL)                    /*!< SCU_RESET PRSTAT0: HRPWM0RS (Bit 23)                        */
#define SCU_RESET_PRSTAT0_HRPWM0RS_Msk        (0x800000UL)              /*!< SCU_RESET PRSTAT0: HRPWM0RS (Bitfield-Mask: 0x01)           */

