MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4108-Q48K64/mcu.h
/* ---------------------------------  USB_GRXFSIZ  -------------------------------- */
#define USB_GRXFSIZ_RxFDep_Pos                (0UL)                     /*!< USB GRXFSIZ: RxFDep (Bit 0)                                 */
#define USB_GRXFSIZ_RxFDep_Msk                (0xffffUL)                /*!< USB GRXFSIZ: RxFDep (Bitfield-Mask: 0xffff)                 */

/* --------------------------------  USB_GNPTXFSIZ  ------------------------------- */
#define USB_GNPTXFSIZ_INEPTxF0StAddr_Pos      (0UL)                     /*!< USB GNPTXFSIZ: INEPTxF0StAddr (Bit 0)                       */
#define USB_GNPTXFSIZ_INEPTxF0StAddr_Msk      (0xffffUL)                /*!< USB GNPTXFSIZ: INEPTxF0StAddr (Bitfield-Mask: 0xffff)       */
#define USB_GNPTXFSIZ_INEPTxF0Dep_Pos         (16UL)                    /*!< USB GNPTXFSIZ: INEPTxF0Dep (Bit 16)                         */
#define USB_GNPTXFSIZ_INEPTxF0Dep_Msk         (0xffff0000UL)            /*!< USB GNPTXFSIZ: INEPTxF0Dep (Bitfield-Mask: 0xffff)          */

/* ----------------------------------  USB_GUID  ---------------------------------- */
#define USB_GUID_MOD_REV_Pos                  (0UL)                     /*!< USB GUID: MOD_REV (Bit 0)                                   */
#define USB_GUID_MOD_REV_Msk                  (0xffUL)                  /*!< USB GUID: MOD_REV (Bitfield-Mask: 0xff)                     */
#define USB_GUID_MOD_TYPE_Pos                 (8UL)                     /*!< USB GUID: MOD_TYPE (Bit 8)                                  */
#define USB_GUID_MOD_TYPE_Msk                 (0xff00UL)                /*!< USB GUID: MOD_TYPE (Bitfield-Mask: 0xff)                    */
#define USB_GUID_MOD_NUMBER_Pos               (16UL)                    /*!< USB GUID: MOD_NUMBER (Bit 16)                               */
#define USB_GUID_MOD_NUMBER_Msk               (0xffff0000UL)            /*!< USB GUID: MOD_NUMBER (Bitfield-Mask: 0xffff)                */

/* --------------------------------  USB_GDFIFOCFG  ------------------------------- */
#define USB_GDFIFOCFG_GDFIFOCfg_Pos           (0UL)                     /*!< USB GDFIFOCFG: GDFIFOCfg (Bit 0)                            */
#define USB_GDFIFOCFG_GDFIFOCfg_Msk           (0xffffUL)                /*!< USB GDFIFOCFG: GDFIFOCfg (Bitfield-Mask: 0xffff)            */
#define USB_GDFIFOCFG_EPInfoBaseAddr_Pos      (16UL)                    /*!< USB GDFIFOCFG: EPInfoBaseAddr (Bit 16)                      */
#define USB_GDFIFOCFG_EPInfoBaseAddr_Msk      (0xffff0000UL)            /*!< USB GDFIFOCFG: EPInfoBaseAddr (Bitfield-Mask: 0xffff)       */

/* --------------------------------  USB_DIEPTXF1  -------------------------------- */
#define USB_DIEPTXF1_INEPnTxFStAddr_Pos       (0UL)                     /*!< USB DIEPTXF1: INEPnTxFStAddr (Bit 0)                        */
#define USB_DIEPTXF1_INEPnTxFStAddr_Msk       (0xffffUL)                /*!< USB DIEPTXF1: INEPnTxFStAddr (Bitfield-Mask: 0xffff)        */
#define USB_DIEPTXF1_INEPnTxFDep_Pos          (16UL)                    /*!< USB DIEPTXF1: INEPnTxFDep (Bit 16)                          */
#define USB_DIEPTXF1_INEPnTxFDep_Msk          (0xffff0000UL)            /*!< USB DIEPTXF1: INEPnTxFDep (Bitfield-Mask: 0xffff)           */

/* --------------------------------  USB_DIEPTXF2  -------------------------------- */
#define USB_DIEPTXF2_INEPnTxFStAddr_Pos       (0UL)                     /*!< USB DIEPTXF2: INEPnTxFStAddr (Bit 0)                        */
#define USB_DIEPTXF2_INEPnTxFStAddr_Msk       (0xffffUL)                /*!< USB DIEPTXF2: INEPnTxFStAddr (Bitfield-Mask: 0xffff)        */
#define USB_DIEPTXF2_INEPnTxFDep_Pos          (16UL)                    /*!< USB DIEPTXF2: INEPnTxFDep (Bit 16)                          */
#define USB_DIEPTXF2_INEPnTxFDep_Msk          (0xffff0000UL)            /*!< USB DIEPTXF2: INEPnTxFDep (Bitfield-Mask: 0xffff)           */

/* --------------------------------  USB_DIEPTXF3  -------------------------------- */
#define USB_DIEPTXF3_INEPnTxFStAddr_Pos       (0UL)                     /*!< USB DIEPTXF3: INEPnTxFStAddr (Bit 0)                        */
#define USB_DIEPTXF3_INEPnTxFStAddr_Msk       (0xffffUL)                /*!< USB DIEPTXF3: INEPnTxFStAddr (Bitfield-Mask: 0xffff)        */
#define USB_DIEPTXF3_INEPnTxFDep_Pos          (16UL)                    /*!< USB DIEPTXF3: INEPnTxFDep (Bit 16)                          */
#define USB_DIEPTXF3_INEPnTxFDep_Msk          (0xffff0000UL)            /*!< USB DIEPTXF3: INEPnTxFDep (Bitfield-Mask: 0xffff)           */

/* --------------------------------  USB_DIEPTXF4  -------------------------------- */
#define USB_DIEPTXF4_INEPnTxFStAddr_Pos       (0UL)                     /*!< USB DIEPTXF4: INEPnTxFStAddr (Bit 0)                        */
#define USB_DIEPTXF4_INEPnTxFStAddr_Msk       (0xffffUL)                /*!< USB DIEPTXF4: INEPnTxFStAddr (Bitfield-Mask: 0xffff)        */
#define USB_DIEPTXF4_INEPnTxFDep_Pos          (16UL)                    /*!< USB DIEPTXF4: INEPnTxFDep (Bit 16)                          */
#define USB_DIEPTXF4_INEPnTxFDep_Msk          (0xffff0000UL)            /*!< USB DIEPTXF4: INEPnTxFDep (Bitfield-Mask: 0xffff)           */

/* --------------------------------  USB_DIEPTXF5  -------------------------------- */
#define USB_DIEPTXF5_INEPnTxFStAddr_Pos       (0UL)                     /*!< USB DIEPTXF5: INEPnTxFStAddr (Bit 0)                        */
#define USB_DIEPTXF5_INEPnTxFStAddr_Msk       (0xffffUL)                /*!< USB DIEPTXF5: INEPnTxFStAddr (Bitfield-Mask: 0xffff)        */
#define USB_DIEPTXF5_INEPnTxFDep_Pos          (16UL)                    /*!< USB DIEPTXF5: INEPnTxFDep (Bit 16)                          */
#define USB_DIEPTXF5_INEPnTxFDep_Msk          (0xffff0000UL)            /*!< USB DIEPTXF5: INEPnTxFDep (Bitfield-Mask: 0xffff)           */

/* --------------------------------  USB_DIEPTXF6  -------------------------------- */
#define USB_DIEPTXF6_INEPnTxFStAddr_Pos       (0UL)                     /*!< USB DIEPTXF6: INEPnTxFStAddr (Bit 0)                        */
#define USB_DIEPTXF6_INEPnTxFStAddr_Msk       (0xffffUL)                /*!< USB DIEPTXF6: INEPnTxFStAddr (Bitfield-Mask: 0xffff)        */
#define USB_DIEPTXF6_INEPnTxFDep_Pos          (16UL)                    /*!< USB DIEPTXF6: INEPnTxFDep (Bit 16)                          */
#define USB_DIEPTXF6_INEPnTxFDep_Msk          (0xffff0000UL)            /*!< USB DIEPTXF6: INEPnTxFDep (Bitfield-Mask: 0xffff)           */

/* ----------------------------------  USB_DCFG  ---------------------------------- */
#define USB_DCFG_DevSpd_Pos                   (0UL)                     /*!< USB DCFG: DevSpd (Bit 0)                                    */
#define USB_DCFG_DevSpd_Msk                   (0x3UL)                   /*!< USB DCFG: DevSpd (Bitfield-Mask: 0x03)                      */
#define USB_DCFG_NZStsOUTHShk_Pos             (2UL)                     /*!< USB DCFG: NZStsOUTHShk (Bit 2)                              */
#define USB_DCFG_NZStsOUTHShk_Msk             (0x4UL)                   /*!< USB DCFG: NZStsOUTHShk (Bitfield-Mask: 0x01)                */
#define USB_DCFG_DevAddr_Pos                  (4UL)                     /*!< USB DCFG: DevAddr (Bit 4)                                   */
#define USB_DCFG_DevAddr_Msk                  (0x7f0UL)                 /*!< USB DCFG: DevAddr (Bitfield-Mask: 0x7f)                     */
#define USB_DCFG_PerFrInt_Pos                 (11UL)                    /*!< USB DCFG: PerFrInt (Bit 11)                                 */
#define USB_DCFG_PerFrInt_Msk                 (0x1800UL)                /*!< USB DCFG: PerFrInt (Bitfield-Mask: 0x03)                    */
#define USB_DCFG_DescDMA_Pos                  (23UL)                    /*!< USB DCFG: DescDMA (Bit 23)                                  */
#define USB_DCFG_DescDMA_Msk                  (0x800000UL)              /*!< USB DCFG: DescDMA (Bitfield-Mask: 0x01)                     */
#define USB_DCFG_PerSchIntvl_Pos              (24UL)                    /*!< USB DCFG: PerSchIntvl (Bit 24)                              */
#define USB_DCFG_PerSchIntvl_Msk              (0x3000000UL)             /*!< USB DCFG: PerSchIntvl (Bitfield-Mask: 0x03)                 */

/* ----------------------------------  USB_DCTL  ---------------------------------- */
#define USB_DCTL_RmtWkUpSig_Pos               (0UL)                     /*!< USB DCTL: RmtWkUpSig (Bit 0)                                */
#define USB_DCTL_RmtWkUpSig_Msk               (0x1UL)                   /*!< USB DCTL: RmtWkUpSig (Bitfield-Mask: 0x01)                  */
#define USB_DCTL_SftDiscon_Pos                (1UL)                     /*!< USB DCTL: SftDiscon (Bit 1)                                 */
#define USB_DCTL_SftDiscon_Msk                (0x2UL)                   /*!< USB DCTL: SftDiscon (Bitfield-Mask: 0x01)                   */
#define USB_DCTL_GNPINNakSts_Pos              (2UL)                     /*!< USB DCTL: GNPINNakSts (Bit 2)                               */
#define USB_DCTL_GNPINNakSts_Msk              (0x4UL)                   /*!< USB DCTL: GNPINNakSts (Bitfield-Mask: 0x01)                 */
#define USB_DCTL_GOUTNakSts_Pos               (3UL)                     /*!< USB DCTL: GOUTNakSts (Bit 3)                                */
#define USB_DCTL_GOUTNakSts_Msk               (0x8UL)                   /*!< USB DCTL: GOUTNakSts (Bitfield-Mask: 0x01)                  */
#define USB_DCTL_SGNPInNak_Pos                (7UL)                     /*!< USB DCTL: SGNPInNak (Bit 7)                                 */
#define USB_DCTL_SGNPInNak_Msk                (0x80UL)                  /*!< USB DCTL: SGNPInNak (Bitfield-Mask: 0x01)                   */
#define USB_DCTL_CGNPInNak_Pos                (8UL)                     /*!< USB DCTL: CGNPInNak (Bit 8)                                 */
#define USB_DCTL_CGNPInNak_Msk                (0x100UL)                 /*!< USB DCTL: CGNPInNak (Bitfield-Mask: 0x01)                   */
#define USB_DCTL_SGOUTNak_Pos                 (9UL)                     /*!< USB DCTL: SGOUTNak (Bit 9)                                  */
#define USB_DCTL_SGOUTNak_Msk                 (0x200UL)                 /*!< USB DCTL: SGOUTNak (Bitfield-Mask: 0x01)                    */
#define USB_DCTL_CGOUTNak_Pos                 (10UL)                    /*!< USB DCTL: CGOUTNak (Bit 10)                                 */
#define USB_DCTL_CGOUTNak_Msk                 (0x400UL)                 /*!< USB DCTL: CGOUTNak (Bitfield-Mask: 0x01)                    */
#define USB_DCTL_GMC_Pos                      (13UL)                    /*!< USB DCTL: GMC (Bit 13)                                      */
#define USB_DCTL_GMC_Msk                      (0x6000UL)                /*!< USB DCTL: GMC (Bitfield-Mask: 0x03)                         */
#define USB_DCTL_IgnrFrmNum_Pos               (15UL)                    /*!< USB DCTL: IgnrFrmNum (Bit 15)                               */
#define USB_DCTL_IgnrFrmNum_Msk               (0x8000UL)                /*!< USB DCTL: IgnrFrmNum (Bitfield-Mask: 0x01)                  */
#define USB_DCTL_NakOnBble_Pos                (16UL)                    /*!< USB DCTL: NakOnBble (Bit 16)                                */
#define USB_DCTL_NakOnBble_Msk                (0x10000UL)               /*!< USB DCTL: NakOnBble (Bitfield-Mask: 0x01)                   */
#define USB_DCTL_EnContOnBNA_Pos              (17UL)                    /*!< USB DCTL: EnContOnBNA (Bit 17)                              */
#define USB_DCTL_EnContOnBNA_Msk              (0x20000UL)               /*!< USB DCTL: EnContOnBNA (Bitfield-Mask: 0x01)                 */

/* ----------------------------------  USB_DSTS  ---------------------------------- */
#define USB_DSTS_SuspSts_Pos                  (0UL)                     /*!< USB DSTS: SuspSts (Bit 0)                                   */
#define USB_DSTS_SuspSts_Msk                  (0x1UL)                   /*!< USB DSTS: SuspSts (Bitfield-Mask: 0x01)                     */
#define USB_DSTS_EnumSpd_Pos                  (1UL)                     /*!< USB DSTS: EnumSpd (Bit 1)                                   */
#define USB_DSTS_EnumSpd_Msk                  (0x6UL)                   /*!< USB DSTS: EnumSpd (Bitfield-Mask: 0x03)                     */
#define USB_DSTS_ErrticErr_Pos                (3UL)                     /*!< USB DSTS: ErrticErr (Bit 3)                                 */
#define USB_DSTS_ErrticErr_Msk                (0x8UL)                   /*!< USB DSTS: ErrticErr (Bitfield-Mask: 0x01)                   */
#define USB_DSTS_SOFFN_Pos                    (8UL)                     /*!< USB DSTS: SOFFN (Bit 8)                                     */
#define USB_DSTS_SOFFN_Msk                    (0x3fff00UL)              /*!< USB DSTS: SOFFN (Bitfield-Mask: 0x3fff)                     */

/* ---------------------------------  USB_DIEPMSK  -------------------------------- */
#define USB_DIEPMSK_XferComplMsk_Pos          (0UL)                     /*!< USB DIEPMSK: XferComplMsk (Bit 0)                           */
#define USB_DIEPMSK_XferComplMsk_Msk          (0x1UL)                   /*!< USB DIEPMSK: XferComplMsk (Bitfield-Mask: 0x01)             */
#define USB_DIEPMSK_EPDisbldMsk_Pos           (1UL)                     /*!< USB DIEPMSK: EPDisbldMsk (Bit 1)                            */
#define USB_DIEPMSK_EPDisbldMsk_Msk           (0x2UL)                   /*!< USB DIEPMSK: EPDisbldMsk (Bitfield-Mask: 0x01)              */
#define USB_DIEPMSK_AHBErrMsk_Pos             (2UL)                     /*!< USB DIEPMSK: AHBErrMsk (Bit 2)                              */
#define USB_DIEPMSK_AHBErrMsk_Msk             (0x4UL)                   /*!< USB DIEPMSK: AHBErrMsk (Bitfield-Mask: 0x01)                */
#define USB_DIEPMSK_TimeOUTMsk_Pos            (3UL)                     /*!< USB DIEPMSK: TimeOUTMsk (Bit 3)                             */
#define USB_DIEPMSK_TimeOUTMsk_Msk            (0x8UL)                   /*!< USB DIEPMSK: TimeOUTMsk (Bitfield-Mask: 0x01)               */
#define USB_DIEPMSK_INTknTXFEmpMsk_Pos        (4UL)                     /*!< USB DIEPMSK: INTknTXFEmpMsk (Bit 4)                         */
#define USB_DIEPMSK_INTknTXFEmpMsk_Msk        (0x10UL)                  /*!< USB DIEPMSK: INTknTXFEmpMsk (Bitfield-Mask: 0x01)           */
#define USB_DIEPMSK_INEPNakEffMsk_Pos         (6UL)                     /*!< USB DIEPMSK: INEPNakEffMsk (Bit 6)                          */
#define USB_DIEPMSK_INEPNakEffMsk_Msk         (0x40UL)                  /*!< USB DIEPMSK: INEPNakEffMsk (Bitfield-Mask: 0x01)            */
#define USB_DIEPMSK_TxfifoUndrnMsk_Pos        (8UL)                     /*!< USB DIEPMSK: TxfifoUndrnMsk (Bit 8)                         */
#define USB_DIEPMSK_TxfifoUndrnMsk_Msk        (0x100UL)                 /*!< USB DIEPMSK: TxfifoUndrnMsk (Bitfield-Mask: 0x01)           */
#define USB_DIEPMSK_BNAInIntrMsk_Pos          (9UL)                     /*!< USB DIEPMSK: BNAInIntrMsk (Bit 9)                           */
#define USB_DIEPMSK_BNAInIntrMsk_Msk          (0x200UL)                 /*!< USB DIEPMSK: BNAInIntrMsk (Bitfield-Mask: 0x01)             */
#define USB_DIEPMSK_NAKMsk_Pos                (13UL)                    /*!< USB DIEPMSK: NAKMsk (Bit 13)                                */
#define USB_DIEPMSK_NAKMsk_Msk                (0x2000UL)                /*!< USB DIEPMSK: NAKMsk (Bitfield-Mask: 0x01)                   */

/* ---------------------------------  USB_DOEPMSK  -------------------------------- */
#define USB_DOEPMSK_XferComplMsk_Pos          (0UL)                     /*!< USB DOEPMSK: XferComplMsk (Bit 0)                           */
#define USB_DOEPMSK_XferComplMsk_Msk          (0x1UL)                   /*!< USB DOEPMSK: XferComplMsk (Bitfield-Mask: 0x01)             */
#define USB_DOEPMSK_EPDisbldMsk_Pos           (1UL)                     /*!< USB DOEPMSK: EPDisbldMsk (Bit 1)                            */
#define USB_DOEPMSK_EPDisbldMsk_Msk           (0x2UL)                   /*!< USB DOEPMSK: EPDisbldMsk (Bitfield-Mask: 0x01)              */
#define USB_DOEPMSK_AHBErrMsk_Pos             (2UL)                     /*!< USB DOEPMSK: AHBErrMsk (Bit 2)                              */
#define USB_DOEPMSK_AHBErrMsk_Msk             (0x4UL)                   /*!< USB DOEPMSK: AHBErrMsk (Bitfield-Mask: 0x01)                */
#define USB_DOEPMSK_SetUPMsk_Pos              (3UL)                     /*!< USB DOEPMSK: SetUPMsk (Bit 3)                               */
#define USB_DOEPMSK_SetUPMsk_Msk              (0x8UL)                   /*!< USB DOEPMSK: SetUPMsk (Bitfield-Mask: 0x01)                 */
#define USB_DOEPMSK_OUTTknEPdisMsk_Pos        (4UL)                     /*!< USB DOEPMSK: OUTTknEPdisMsk (Bit 4)                         */
#define USB_DOEPMSK_OUTTknEPdisMsk_Msk        (0x10UL)                  /*!< USB DOEPMSK: OUTTknEPdisMsk (Bitfield-Mask: 0x01)           */
#define USB_DOEPMSK_Back2BackSETup_Pos        (6UL)                     /*!< USB DOEPMSK: Back2BackSETup (Bit 6)                         */
#define USB_DOEPMSK_Back2BackSETup_Msk        (0x40UL)                  /*!< USB DOEPMSK: Back2BackSETup (Bitfield-Mask: 0x01)           */
#define USB_DOEPMSK_OutPktErrMsk_Pos          (8UL)                     /*!< USB DOEPMSK: OutPktErrMsk (Bit 8)                           */
#define USB_DOEPMSK_OutPktErrMsk_Msk          (0x100UL)                 /*!< USB DOEPMSK: OutPktErrMsk (Bitfield-Mask: 0x01)             */
#define USB_DOEPMSK_BnaOutIntrMsk_Pos         (9UL)                     /*!< USB DOEPMSK: BnaOutIntrMsk (Bit 9)                          */
#define USB_DOEPMSK_BnaOutIntrMsk_Msk         (0x200UL)                 /*!< USB DOEPMSK: BnaOutIntrMsk (Bitfield-Mask: 0x01)            */
#define USB_DOEPMSK_BbleErrMsk_Pos            (12UL)                    /*!< USB DOEPMSK: BbleErrMsk (Bit 12)                            */
#define USB_DOEPMSK_BbleErrMsk_Msk            (0x1000UL)                /*!< USB DOEPMSK: BbleErrMsk (Bitfield-Mask: 0x01)               */
#define USB_DOEPMSK_NAKMsk_Pos                (13UL)                    /*!< USB DOEPMSK: NAKMsk (Bit 13)                                */
#define USB_DOEPMSK_NAKMsk_Msk                (0x2000UL)                /*!< USB DOEPMSK: NAKMsk (Bitfield-Mask: 0x01)                   */
#define USB_DOEPMSK_NYETMsk_Pos               (14UL)                    /*!< USB DOEPMSK: NYETMsk (Bit 14)                               */
#define USB_DOEPMSK_NYETMsk_Msk               (0x4000UL)                /*!< USB DOEPMSK: NYETMsk (Bitfield-Mask: 0x01)                  */

/* ----------------------------------  USB_DAINT  --------------------------------- */
#define USB_DAINT_InEpInt_Pos                 (0UL)                     /*!< USB DAINT: InEpInt (Bit 0)                                  */
#define USB_DAINT_InEpInt_Msk                 (0xffffUL)                /*!< USB DAINT: InEpInt (Bitfield-Mask: 0xffff)                  */
#define USB_DAINT_OutEPInt_Pos                (16UL)                    /*!< USB DAINT: OutEPInt (Bit 16)                                */
#define USB_DAINT_OutEPInt_Msk                (0xffff0000UL)            /*!< USB DAINT: OutEPInt (Bitfield-Mask: 0xffff)                 */

/* --------------------------------  USB_DAINTMSK  -------------------------------- */
#define USB_DAINTMSK_InEpMsk_Pos              (0UL)                     /*!< USB DAINTMSK: InEpMsk (Bit 0)                               */
#define USB_DAINTMSK_InEpMsk_Msk              (0xffffUL)                /*!< USB DAINTMSK: InEpMsk (Bitfield-Mask: 0xffff)               */
#define USB_DAINTMSK_OutEpMsk_Pos             (16UL)                    /*!< USB DAINTMSK: OutEpMsk (Bit 16)                             */
#define USB_DAINTMSK_OutEpMsk_Msk             (0xffff0000UL)            /*!< USB DAINTMSK: OutEpMsk (Bitfield-Mask: 0xffff)              */

/* --------------------------------  USB_DVBUSDIS  -------------------------------- */
#define USB_DVBUSDIS_DVBUSDis_Pos             (0UL)                     /*!< USB DVBUSDIS: DVBUSDis (Bit 0)                              */
#define USB_DVBUSDIS_DVBUSDis_Msk             (0xffffUL)                /*!< USB DVBUSDIS: DVBUSDis (Bitfield-Mask: 0xffff)              */

