MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4108-Q48K64/mcu.h
/* -------------------------------  USB_EP_DTXFSTS  ------------------------------- */
#define USB_EP_DTXFSTS_INEPTxFSpcAvail_Pos    (0UL)                     /*!< USB_EP DTXFSTS: INEPTxFSpcAvail (Bit 0)                     */
#define USB_EP_DTXFSTS_INEPTxFSpcAvail_Msk    (0xffffUL)                /*!< USB_EP DTXFSTS: INEPTxFSpcAvail (Bitfield-Mask: 0xffff)     */

/* -------------------------------  USB_EP_DIEPDMAB  ------------------------------ */
#define USB_EP_DIEPDMAB_DMABufferAddr_Pos     (0UL)                     /*!< USB_EP DIEPDMAB: DMABufferAddr (Bit 0)                      */
#define USB_EP_DIEPDMAB_DMABufferAddr_Msk     (0xffffffffUL)            /*!< USB_EP DIEPDMAB: DMABufferAddr (Bitfield-Mask: 0xffffffff)  */

/* ---------------------------  USB_EP_DOEPCTL_ISOCONT  --------------------------- */
#define USB_EP_DOEPCTL_ISOCONT_MPS_Pos        (0UL)                     /*!< USB_EP DOEPCTL_ISOCONT: MPS (Bit 0)                         */
#define USB_EP_DOEPCTL_ISOCONT_MPS_Msk        (0x7ffUL)                 /*!< USB_EP DOEPCTL_ISOCONT: MPS (Bitfield-Mask: 0x7ff)          */
#define USB_EP_DOEPCTL_ISOCONT_USBActEP_Pos   (15UL)                    /*!< USB_EP DOEPCTL_ISOCONT: USBActEP (Bit 15)                   */
#define USB_EP_DOEPCTL_ISOCONT_USBActEP_Msk   (0x8000UL)                /*!< USB_EP DOEPCTL_ISOCONT: USBActEP (Bitfield-Mask: 0x01)      */
#define USB_EP_DOEPCTL_ISOCONT_EO_FrNum_Pos   (16UL)                    /*!< USB_EP DOEPCTL_ISOCONT: EO_FrNum (Bit 16)                   */
#define USB_EP_DOEPCTL_ISOCONT_EO_FrNum_Msk   (0x10000UL)               /*!< USB_EP DOEPCTL_ISOCONT: EO_FrNum (Bitfield-Mask: 0x01)      */
#define USB_EP_DOEPCTL_ISOCONT_NAKSts_Pos     (17UL)                    /*!< USB_EP DOEPCTL_ISOCONT: NAKSts (Bit 17)                     */
#define USB_EP_DOEPCTL_ISOCONT_NAKSts_Msk     (0x20000UL)               /*!< USB_EP DOEPCTL_ISOCONT: NAKSts (Bitfield-Mask: 0x01)        */
#define USB_EP_DOEPCTL_ISOCONT_EPType_Pos     (18UL)                    /*!< USB_EP DOEPCTL_ISOCONT: EPType (Bit 18)                     */
#define USB_EP_DOEPCTL_ISOCONT_EPType_Msk     (0xc0000UL)               /*!< USB_EP DOEPCTL_ISOCONT: EPType (Bitfield-Mask: 0x03)        */
#define USB_EP_DOEPCTL_ISOCONT_Snp_Pos        (20UL)                    /*!< USB_EP DOEPCTL_ISOCONT: Snp (Bit 20)                        */
#define USB_EP_DOEPCTL_ISOCONT_Snp_Msk        (0x100000UL)              /*!< USB_EP DOEPCTL_ISOCONT: Snp (Bitfield-Mask: 0x01)           */
#define USB_EP_DOEPCTL_ISOCONT_Stall_Pos      (21UL)                    /*!< USB_EP DOEPCTL_ISOCONT: Stall (Bit 21)                      */
#define USB_EP_DOEPCTL_ISOCONT_Stall_Msk      (0x200000UL)              /*!< USB_EP DOEPCTL_ISOCONT: Stall (Bitfield-Mask: 0x01)         */
#define USB_EP_DOEPCTL_ISOCONT_TxFNum_Pos     (22UL)                    /*!< USB_EP DOEPCTL_ISOCONT: TxFNum (Bit 22)                     */
#define USB_EP_DOEPCTL_ISOCONT_TxFNum_Msk     (0x3c00000UL)             /*!< USB_EP DOEPCTL_ISOCONT: TxFNum (Bitfield-Mask: 0x0f)        */
#define USB_EP_DOEPCTL_ISOCONT_CNAK_Pos       (26UL)                    /*!< USB_EP DOEPCTL_ISOCONT: CNAK (Bit 26)                       */
#define USB_EP_DOEPCTL_ISOCONT_CNAK_Msk       (0x4000000UL)             /*!< USB_EP DOEPCTL_ISOCONT: CNAK (Bitfield-Mask: 0x01)          */
#define USB_EP_DOEPCTL_ISOCONT_SNAK_Pos       (27UL)                    /*!< USB_EP DOEPCTL_ISOCONT: SNAK (Bit 27)                       */
#define USB_EP_DOEPCTL_ISOCONT_SNAK_Msk       (0x8000000UL)             /*!< USB_EP DOEPCTL_ISOCONT: SNAK (Bitfield-Mask: 0x01)          */
#define USB_EP_DOEPCTL_ISOCONT_SetEvenFr_Pos  (28UL)                    /*!< USB_EP DOEPCTL_ISOCONT: SetEvenFr (Bit 28)                  */
#define USB_EP_DOEPCTL_ISOCONT_SetEvenFr_Msk  (0x10000000UL)            /*!< USB_EP DOEPCTL_ISOCONT: SetEvenFr (Bitfield-Mask: 0x01)     */
#define USB_EP_DOEPCTL_ISOCONT_SetOddFr_Pos   (29UL)                    /*!< USB_EP DOEPCTL_ISOCONT: SetOddFr (Bit 29)                   */
#define USB_EP_DOEPCTL_ISOCONT_SetOddFr_Msk   (0x20000000UL)            /*!< USB_EP DOEPCTL_ISOCONT: SetOddFr (Bitfield-Mask: 0x01)      */
#define USB_EP_DOEPCTL_ISOCONT_EPDis_Pos      (30UL)                    /*!< USB_EP DOEPCTL_ISOCONT: EPDis (Bit 30)                      */
#define USB_EP_DOEPCTL_ISOCONT_EPDis_Msk      (0x40000000UL)            /*!< USB_EP DOEPCTL_ISOCONT: EPDis (Bitfield-Mask: 0x01)         */
#define USB_EP_DOEPCTL_ISOCONT_EPEna_Pos      (31UL)                    /*!< USB_EP DOEPCTL_ISOCONT: EPEna (Bit 31)                      */
#define USB_EP_DOEPCTL_ISOCONT_EPEna_Msk      (0x80000000UL)            /*!< USB_EP DOEPCTL_ISOCONT: EPEna (Bitfield-Mask: 0x01)         */

/* ---------------------------  USB_EP_DOEPCTL_INTBULK  --------------------------- */
#define USB_EP_DOEPCTL_INTBULK_MPS_Pos        (0UL)                     /*!< USB_EP DOEPCTL_INTBULK: MPS (Bit 0)                         */
#define USB_EP_DOEPCTL_INTBULK_MPS_Msk        (0x7ffUL)                 /*!< USB_EP DOEPCTL_INTBULK: MPS (Bitfield-Mask: 0x7ff)          */
#define USB_EP_DOEPCTL_INTBULK_USBActEP_Pos   (15UL)                    /*!< USB_EP DOEPCTL_INTBULK: USBActEP (Bit 15)                   */
#define USB_EP_DOEPCTL_INTBULK_USBActEP_Msk   (0x8000UL)                /*!< USB_EP DOEPCTL_INTBULK: USBActEP (Bitfield-Mask: 0x01)      */
#define USB_EP_DOEPCTL_INTBULK_DPID_Pos       (16UL)                    /*!< USB_EP DOEPCTL_INTBULK: DPID (Bit 16)                       */
#define USB_EP_DOEPCTL_INTBULK_DPID_Msk       (0x10000UL)               /*!< USB_EP DOEPCTL_INTBULK: DPID (Bitfield-Mask: 0x01)          */
#define USB_EP_DOEPCTL_INTBULK_NAKSts_Pos     (17UL)                    /*!< USB_EP DOEPCTL_INTBULK: NAKSts (Bit 17)                     */
#define USB_EP_DOEPCTL_INTBULK_NAKSts_Msk     (0x20000UL)               /*!< USB_EP DOEPCTL_INTBULK: NAKSts (Bitfield-Mask: 0x01)        */
#define USB_EP_DOEPCTL_INTBULK_EPType_Pos     (18UL)                    /*!< USB_EP DOEPCTL_INTBULK: EPType (Bit 18)                     */
#define USB_EP_DOEPCTL_INTBULK_EPType_Msk     (0xc0000UL)               /*!< USB_EP DOEPCTL_INTBULK: EPType (Bitfield-Mask: 0x03)        */
#define USB_EP_DOEPCTL_INTBULK_Snp_Pos        (20UL)                    /*!< USB_EP DOEPCTL_INTBULK: Snp (Bit 20)                        */
#define USB_EP_DOEPCTL_INTBULK_Snp_Msk        (0x100000UL)              /*!< USB_EP DOEPCTL_INTBULK: Snp (Bitfield-Mask: 0x01)           */
#define USB_EP_DOEPCTL_INTBULK_Stall_Pos      (21UL)                    /*!< USB_EP DOEPCTL_INTBULK: Stall (Bit 21)                      */
#define USB_EP_DOEPCTL_INTBULK_Stall_Msk      (0x200000UL)              /*!< USB_EP DOEPCTL_INTBULK: Stall (Bitfield-Mask: 0x01)         */
#define USB_EP_DOEPCTL_INTBULK_TxFNum_Pos     (22UL)                    /*!< USB_EP DOEPCTL_INTBULK: TxFNum (Bit 22)                     */
#define USB_EP_DOEPCTL_INTBULK_TxFNum_Msk     (0x3c00000UL)             /*!< USB_EP DOEPCTL_INTBULK: TxFNum (Bitfield-Mask: 0x0f)        */
#define USB_EP_DOEPCTL_INTBULK_CNAK_Pos       (26UL)                    /*!< USB_EP DOEPCTL_INTBULK: CNAK (Bit 26)                       */
#define USB_EP_DOEPCTL_INTBULK_CNAK_Msk       (0x4000000UL)             /*!< USB_EP DOEPCTL_INTBULK: CNAK (Bitfield-Mask: 0x01)          */
#define USB_EP_DOEPCTL_INTBULK_SNAK_Pos       (27UL)                    /*!< USB_EP DOEPCTL_INTBULK: SNAK (Bit 27)                       */
#define USB_EP_DOEPCTL_INTBULK_SNAK_Msk       (0x8000000UL)             /*!< USB_EP DOEPCTL_INTBULK: SNAK (Bitfield-Mask: 0x01)          */
#define USB_EP_DOEPCTL_INTBULK_SetD0PID_Pos   (28UL)                    /*!< USB_EP DOEPCTL_INTBULK: SetD0PID (Bit 28)                   */
#define USB_EP_DOEPCTL_INTBULK_SetD0PID_Msk   (0x10000000UL)            /*!< USB_EP DOEPCTL_INTBULK: SetD0PID (Bitfield-Mask: 0x01)      */
#define USB_EP_DOEPCTL_INTBULK_SetD1PID_Pos   (29UL)                    /*!< USB_EP DOEPCTL_INTBULK: SetD1PID (Bit 29)                   */
#define USB_EP_DOEPCTL_INTBULK_SetD1PID_Msk   (0x20000000UL)            /*!< USB_EP DOEPCTL_INTBULK: SetD1PID (Bitfield-Mask: 0x01)      */
#define USB_EP_DOEPCTL_INTBULK_EPDis_Pos      (30UL)                    /*!< USB_EP DOEPCTL_INTBULK: EPDis (Bit 30)                      */
#define USB_EP_DOEPCTL_INTBULK_EPDis_Msk      (0x40000000UL)            /*!< USB_EP DOEPCTL_INTBULK: EPDis (Bitfield-Mask: 0x01)         */
#define USB_EP_DOEPCTL_INTBULK_EPEna_Pos      (31UL)                    /*!< USB_EP DOEPCTL_INTBULK: EPEna (Bit 31)                      */
#define USB_EP_DOEPCTL_INTBULK_EPEna_Msk      (0x80000000UL)            /*!< USB_EP DOEPCTL_INTBULK: EPEna (Bitfield-Mask: 0x01)         */

/* -------------------------------  USB_EP_DOEPINT  ------------------------------- */
#define USB_EP_DOEPINT_XferCompl_Pos          (0UL)                     /*!< USB_EP DOEPINT: XferCompl (Bit 0)                           */
#define USB_EP_DOEPINT_XferCompl_Msk          (0x1UL)                   /*!< USB_EP DOEPINT: XferCompl (Bitfield-Mask: 0x01)             */
#define USB_EP_DOEPINT_EPDisbld_Pos           (1UL)                     /*!< USB_EP DOEPINT: EPDisbld (Bit 1)                            */
#define USB_EP_DOEPINT_EPDisbld_Msk           (0x2UL)                   /*!< USB_EP DOEPINT: EPDisbld (Bitfield-Mask: 0x01)              */
#define USB_EP_DOEPINT_AHBErr_Pos             (2UL)                     /*!< USB_EP DOEPINT: AHBErr (Bit 2)                              */
#define USB_EP_DOEPINT_AHBErr_Msk             (0x4UL)                   /*!< USB_EP DOEPINT: AHBErr (Bitfield-Mask: 0x01)                */
#define USB_EP_DOEPINT_SetUp_Pos              (3UL)                     /*!< USB_EP DOEPINT: SetUp (Bit 3)                               */
#define USB_EP_DOEPINT_SetUp_Msk              (0x8UL)                   /*!< USB_EP DOEPINT: SetUp (Bitfield-Mask: 0x01)                 */
#define USB_EP_DOEPINT_OUTTknEPdis_Pos        (4UL)                     /*!< USB_EP DOEPINT: OUTTknEPdis (Bit 4)                         */
#define USB_EP_DOEPINT_OUTTknEPdis_Msk        (0x10UL)                  /*!< USB_EP DOEPINT: OUTTknEPdis (Bitfield-Mask: 0x01)           */
#define USB_EP_DOEPINT_StsPhseRcvd_Pos        (5UL)                     /*!< USB_EP DOEPINT: StsPhseRcvd (Bit 5)                         */
#define USB_EP_DOEPINT_StsPhseRcvd_Msk        (0x20UL)                  /*!< USB_EP DOEPINT: StsPhseRcvd (Bitfield-Mask: 0x01)           */
#define USB_EP_DOEPINT_Back2BackSETup_Pos     (6UL)                     /*!< USB_EP DOEPINT: Back2BackSETup (Bit 6)                      */
#define USB_EP_DOEPINT_Back2BackSETup_Msk     (0x40UL)                  /*!< USB_EP DOEPINT: Back2BackSETup (Bitfield-Mask: 0x01)        */
#define USB_EP_DOEPINT_BNAIntr_Pos            (9UL)                     /*!< USB_EP DOEPINT: BNAIntr (Bit 9)                             */
#define USB_EP_DOEPINT_BNAIntr_Msk            (0x200UL)                 /*!< USB_EP DOEPINT: BNAIntr (Bitfield-Mask: 0x01)               */
#define USB_EP_DOEPINT_PktDrpSts_Pos          (11UL)                    /*!< USB_EP DOEPINT: PktDrpSts (Bit 11)                          */
#define USB_EP_DOEPINT_PktDrpSts_Msk          (0x800UL)                 /*!< USB_EP DOEPINT: PktDrpSts (Bitfield-Mask: 0x01)             */
#define USB_EP_DOEPINT_BbleErrIntrpt_Pos      (12UL)                    /*!< USB_EP DOEPINT: BbleErrIntrpt (Bit 12)                      */
#define USB_EP_DOEPINT_BbleErrIntrpt_Msk      (0x1000UL)                /*!< USB_EP DOEPINT: BbleErrIntrpt (Bitfield-Mask: 0x01)         */
#define USB_EP_DOEPINT_NAKIntrpt_Pos          (13UL)                    /*!< USB_EP DOEPINT: NAKIntrpt (Bit 13)                          */
#define USB_EP_DOEPINT_NAKIntrpt_Msk          (0x2000UL)                /*!< USB_EP DOEPINT: NAKIntrpt (Bitfield-Mask: 0x01)             */
#define USB_EP_DOEPINT_NYETIntrpt_Pos         (14UL)                    /*!< USB_EP DOEPINT: NYETIntrpt (Bit 14)                         */
#define USB_EP_DOEPINT_NYETIntrpt_Msk         (0x4000UL)                /*!< USB_EP DOEPINT: NYETIntrpt (Bitfield-Mask: 0x01)            */

/* -----------------------------  USB_EP_DOEPTSIZ_ISO  ---------------------------- */
#define USB_EP_DOEPTSIZ_ISO_XferSize_Pos      (0UL)                     /*!< USB_EP DOEPTSIZ_ISO: XferSize (Bit 0)                       */
#define USB_EP_DOEPTSIZ_ISO_XferSize_Msk      (0x7ffffUL)               /*!< USB_EP DOEPTSIZ_ISO: XferSize (Bitfield-Mask: 0x7ffff)      */
#define USB_EP_DOEPTSIZ_ISO_PktCnt_Pos        (19UL)                    /*!< USB_EP DOEPTSIZ_ISO: PktCnt (Bit 19)                        */
#define USB_EP_DOEPTSIZ_ISO_PktCnt_Msk        (0x1ff80000UL)            /*!< USB_EP DOEPTSIZ_ISO: PktCnt (Bitfield-Mask: 0x3ff)          */
#define USB_EP_DOEPTSIZ_ISO_RxDPID_Pos        (29UL)                    /*!< USB_EP DOEPTSIZ_ISO: RxDPID (Bit 29)                        */
#define USB_EP_DOEPTSIZ_ISO_RxDPID_Msk        (0x60000000UL)            /*!< USB_EP DOEPTSIZ_ISO: RxDPID (Bitfield-Mask: 0x03)           */

/* ---------------------------  USB_EP_DOEPTSIZ_CONTROL  -------------------------- */
#define USB_EP_DOEPTSIZ_CONTROL_XferSize_Pos  (0UL)                     /*!< USB_EP DOEPTSIZ_CONTROL: XferSize (Bit 0)                   */
#define USB_EP_DOEPTSIZ_CONTROL_XferSize_Msk  (0x7ffffUL)               /*!< USB_EP DOEPTSIZ_CONTROL: XferSize (Bitfield-Mask: 0x7ffff)  */
#define USB_EP_DOEPTSIZ_CONTROL_PktCnt_Pos    (19UL)                    /*!< USB_EP DOEPTSIZ_CONTROL: PktCnt (Bit 19)                    */
#define USB_EP_DOEPTSIZ_CONTROL_PktCnt_Msk    (0x1ff80000UL)            /*!< USB_EP DOEPTSIZ_CONTROL: PktCnt (Bitfield-Mask: 0x3ff)      */
#define USB_EP_DOEPTSIZ_CONTROL_SUPCnt_Pos    (29UL)                    /*!< USB_EP DOEPTSIZ_CONTROL: SUPCnt (Bit 29)                    */
#define USB_EP_DOEPTSIZ_CONTROL_SUPCnt_Msk    (0x60000000UL)            /*!< USB_EP DOEPTSIZ_CONTROL: SUPCnt (Bitfield-Mask: 0x03)       */

