MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4108-Q48K64/mcu.h
/* --------------------------------  DAC_DAC0CFG0  -------------------------------- */
#define DAC_DAC0CFG0_FREQ_Pos                 (0UL)                     /*!< DAC DAC0CFG0: FREQ (Bit 0)                                  */
#define DAC_DAC0CFG0_FREQ_Msk                 (0xfffffUL)               /*!< DAC DAC0CFG0: FREQ (Bitfield-Mask: 0xfffff)                 */
#define DAC_DAC0CFG0_MODE_Pos                 (20UL)                    /*!< DAC DAC0CFG0: MODE (Bit 20)                                 */
#define DAC_DAC0CFG0_MODE_Msk                 (0x700000UL)              /*!< DAC DAC0CFG0: MODE (Bitfield-Mask: 0x07)                    */
#define DAC_DAC0CFG0_SIGN_Pos                 (23UL)                    /*!< DAC DAC0CFG0: SIGN (Bit 23)                                 */
#define DAC_DAC0CFG0_SIGN_Msk                 (0x800000UL)              /*!< DAC DAC0CFG0: SIGN (Bitfield-Mask: 0x01)                    */
#define DAC_DAC0CFG0_FIFOIND_Pos              (24UL)                    /*!< DAC DAC0CFG0: FIFOIND (Bit 24)                              */
#define DAC_DAC0CFG0_FIFOIND_Msk              (0x3000000UL)             /*!< DAC DAC0CFG0: FIFOIND (Bitfield-Mask: 0x03)                 */
#define DAC_DAC0CFG0_FIFOEMP_Pos              (26UL)                    /*!< DAC DAC0CFG0: FIFOEMP (Bit 26)                              */
#define DAC_DAC0CFG0_FIFOEMP_Msk              (0x4000000UL)             /*!< DAC DAC0CFG0: FIFOEMP (Bitfield-Mask: 0x01)                 */
#define DAC_DAC0CFG0_FIFOFUL_Pos              (27UL)                    /*!< DAC DAC0CFG0: FIFOFUL (Bit 27)                              */
#define DAC_DAC0CFG0_FIFOFUL_Msk              (0x8000000UL)             /*!< DAC DAC0CFG0: FIFOFUL (Bitfield-Mask: 0x01)                 */
#define DAC_DAC0CFG0_NEGATE_Pos               (28UL)                    /*!< DAC DAC0CFG0: NEGATE (Bit 28)                               */
#define DAC_DAC0CFG0_NEGATE_Msk               (0x10000000UL)            /*!< DAC DAC0CFG0: NEGATE (Bitfield-Mask: 0x01)                  */
#define DAC_DAC0CFG0_SIGNEN_Pos               (29UL)                    /*!< DAC DAC0CFG0: SIGNEN (Bit 29)                               */
#define DAC_DAC0CFG0_SIGNEN_Msk               (0x20000000UL)            /*!< DAC DAC0CFG0: SIGNEN (Bitfield-Mask: 0x01)                  */
#define DAC_DAC0CFG0_SREN_Pos                 (30UL)                    /*!< DAC DAC0CFG0: SREN (Bit 30)                                 */
#define DAC_DAC0CFG0_SREN_Msk                 (0x40000000UL)            /*!< DAC DAC0CFG0: SREN (Bitfield-Mask: 0x01)                    */
#define DAC_DAC0CFG0_RUN_Pos                  (31UL)                    /*!< DAC DAC0CFG0: RUN (Bit 31)                                  */
#define DAC_DAC0CFG0_RUN_Msk                  (0x80000000UL)            /*!< DAC DAC0CFG0: RUN (Bitfield-Mask: 0x01)                     */

/* --------------------------------  DAC_DAC0CFG1  -------------------------------- */
#define DAC_DAC0CFG1_SCALE_Pos                (0UL)                     /*!< DAC DAC0CFG1: SCALE (Bit 0)                                 */
#define DAC_DAC0CFG1_SCALE_Msk                (0x7UL)                   /*!< DAC DAC0CFG1: SCALE (Bitfield-Mask: 0x07)                   */
#define DAC_DAC0CFG1_MULDIV_Pos               (3UL)                     /*!< DAC DAC0CFG1: MULDIV (Bit 3)                                */
#define DAC_DAC0CFG1_MULDIV_Msk               (0x8UL)                   /*!< DAC DAC0CFG1: MULDIV (Bitfield-Mask: 0x01)                  */
#define DAC_DAC0CFG1_OFFS_Pos                 (4UL)                     /*!< DAC DAC0CFG1: OFFS (Bit 4)                                  */
#define DAC_DAC0CFG1_OFFS_Msk                 (0xff0UL)                 /*!< DAC DAC0CFG1: OFFS (Bitfield-Mask: 0xff)                    */
#define DAC_DAC0CFG1_TRIGSEL_Pos              (12UL)                    /*!< DAC DAC0CFG1: TRIGSEL (Bit 12)                              */
#define DAC_DAC0CFG1_TRIGSEL_Msk              (0x7000UL)                /*!< DAC DAC0CFG1: TRIGSEL (Bitfield-Mask: 0x07)                 */
#define DAC_DAC0CFG1_DATMOD_Pos               (15UL)                    /*!< DAC DAC0CFG1: DATMOD (Bit 15)                               */
#define DAC_DAC0CFG1_DATMOD_Msk               (0x8000UL)                /*!< DAC DAC0CFG1: DATMOD (Bitfield-Mask: 0x01)                  */
#define DAC_DAC0CFG1_SWTRIG_Pos               (16UL)                    /*!< DAC DAC0CFG1: SWTRIG (Bit 16)                               */
#define DAC_DAC0CFG1_SWTRIG_Msk               (0x10000UL)               /*!< DAC DAC0CFG1: SWTRIG (Bitfield-Mask: 0x01)                  */
#define DAC_DAC0CFG1_TRIGMOD_Pos              (17UL)                    /*!< DAC DAC0CFG1: TRIGMOD (Bit 17)                              */
#define DAC_DAC0CFG1_TRIGMOD_Msk              (0x60000UL)               /*!< DAC DAC0CFG1: TRIGMOD (Bitfield-Mask: 0x03)                 */
#define DAC_DAC0CFG1_ANACFG_Pos               (19UL)                    /*!< DAC DAC0CFG1: ANACFG (Bit 19)                               */
#define DAC_DAC0CFG1_ANACFG_Msk               (0xf80000UL)              /*!< DAC DAC0CFG1: ANACFG (Bitfield-Mask: 0x1f)                  */
#define DAC_DAC0CFG1_ANAEN_Pos                (24UL)                    /*!< DAC DAC0CFG1: ANAEN (Bit 24)                                */
#define DAC_DAC0CFG1_ANAEN_Msk                (0x1000000UL)             /*!< DAC DAC0CFG1: ANAEN (Bitfield-Mask: 0x01)                   */
#define DAC_DAC0CFG1_REFCFGL_Pos              (28UL)                    /*!< DAC DAC0CFG1: REFCFGL (Bit 28)                              */
#define DAC_DAC0CFG1_REFCFGL_Msk              (0xf0000000UL)            /*!< DAC DAC0CFG1: REFCFGL (Bitfield-Mask: 0x0f)                 */

/* --------------------------------  DAC_DAC1CFG0  -------------------------------- */
#define DAC_DAC1CFG0_FREQ_Pos                 (0UL)                     /*!< DAC DAC1CFG0: FREQ (Bit 0)                                  */
#define DAC_DAC1CFG0_FREQ_Msk                 (0xfffffUL)               /*!< DAC DAC1CFG0: FREQ (Bitfield-Mask: 0xfffff)                 */
#define DAC_DAC1CFG0_MODE_Pos                 (20UL)                    /*!< DAC DAC1CFG0: MODE (Bit 20)                                 */
#define DAC_DAC1CFG0_MODE_Msk                 (0x700000UL)              /*!< DAC DAC1CFG0: MODE (Bitfield-Mask: 0x07)                    */
#define DAC_DAC1CFG0_SIGN_Pos                 (23UL)                    /*!< DAC DAC1CFG0: SIGN (Bit 23)                                 */
#define DAC_DAC1CFG0_SIGN_Msk                 (0x800000UL)              /*!< DAC DAC1CFG0: SIGN (Bitfield-Mask: 0x01)                    */
#define DAC_DAC1CFG0_FIFOIND_Pos              (24UL)                    /*!< DAC DAC1CFG0: FIFOIND (Bit 24)                              */
#define DAC_DAC1CFG0_FIFOIND_Msk              (0x3000000UL)             /*!< DAC DAC1CFG0: FIFOIND (Bitfield-Mask: 0x03)                 */
#define DAC_DAC1CFG0_FIFOEMP_Pos              (26UL)                    /*!< DAC DAC1CFG0: FIFOEMP (Bit 26)                              */
#define DAC_DAC1CFG0_FIFOEMP_Msk              (0x4000000UL)             /*!< DAC DAC1CFG0: FIFOEMP (Bitfield-Mask: 0x01)                 */
#define DAC_DAC1CFG0_FIFOFUL_Pos              (27UL)                    /*!< DAC DAC1CFG0: FIFOFUL (Bit 27)                              */
#define DAC_DAC1CFG0_FIFOFUL_Msk              (0x8000000UL)             /*!< DAC DAC1CFG0: FIFOFUL (Bitfield-Mask: 0x01)                 */
#define DAC_DAC1CFG0_NEGATE_Pos               (28UL)                    /*!< DAC DAC1CFG0: NEGATE (Bit 28)                               */
#define DAC_DAC1CFG0_NEGATE_Msk               (0x10000000UL)            /*!< DAC DAC1CFG0: NEGATE (Bitfield-Mask: 0x01)                  */
#define DAC_DAC1CFG0_SIGNEN_Pos               (29UL)                    /*!< DAC DAC1CFG0: SIGNEN (Bit 29)                               */
#define DAC_DAC1CFG0_SIGNEN_Msk               (0x20000000UL)            /*!< DAC DAC1CFG0: SIGNEN (Bitfield-Mask: 0x01)                  */
#define DAC_DAC1CFG0_SREN_Pos                 (30UL)                    /*!< DAC DAC1CFG0: SREN (Bit 30)                                 */
#define DAC_DAC1CFG0_SREN_Msk                 (0x40000000UL)            /*!< DAC DAC1CFG0: SREN (Bitfield-Mask: 0x01)                    */
#define DAC_DAC1CFG0_RUN_Pos                  (31UL)                    /*!< DAC DAC1CFG0: RUN (Bit 31)                                  */
#define DAC_DAC1CFG0_RUN_Msk                  (0x80000000UL)            /*!< DAC DAC1CFG0: RUN (Bitfield-Mask: 0x01)                     */

