MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4108-Q48K64/mcu.h
/* --------------------------------  PORT14_PDISC  -------------------------------- */
#define PORT14_PDISC_PDIS0_Pos                (0UL)                     /*!< PORT14 PDISC: PDIS0 (Bit 0)                                 */
#define PORT14_PDISC_PDIS0_Msk                (0x1UL)                   /*!< PORT14 PDISC: PDIS0 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS1_Pos                (1UL)                     /*!< PORT14 PDISC: PDIS1 (Bit 1)                                 */
#define PORT14_PDISC_PDIS1_Msk                (0x2UL)                   /*!< PORT14 PDISC: PDIS1 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS2_Pos                (2UL)                     /*!< PORT14 PDISC: PDIS2 (Bit 2)                                 */
#define PORT14_PDISC_PDIS2_Msk                (0x4UL)                   /*!< PORT14 PDISC: PDIS2 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS3_Pos                (3UL)                     /*!< PORT14 PDISC: PDIS3 (Bit 3)                                 */
#define PORT14_PDISC_PDIS3_Msk                (0x8UL)                   /*!< PORT14 PDISC: PDIS3 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS4_Pos                (4UL)                     /*!< PORT14 PDISC: PDIS4 (Bit 4)                                 */
#define PORT14_PDISC_PDIS4_Msk                (0x10UL)                  /*!< PORT14 PDISC: PDIS4 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS5_Pos                (5UL)                     /*!< PORT14 PDISC: PDIS5 (Bit 5)                                 */
#define PORT14_PDISC_PDIS5_Msk                (0x20UL)                  /*!< PORT14 PDISC: PDIS5 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS6_Pos                (6UL)                     /*!< PORT14 PDISC: PDIS6 (Bit 6)                                 */
#define PORT14_PDISC_PDIS6_Msk                (0x40UL)                  /*!< PORT14 PDISC: PDIS6 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS7_Pos                (7UL)                     /*!< PORT14 PDISC: PDIS7 (Bit 7)                                 */
#define PORT14_PDISC_PDIS7_Msk                (0x80UL)                  /*!< PORT14 PDISC: PDIS7 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS8_Pos                (8UL)                     /*!< PORT14 PDISC: PDIS8 (Bit 8)                                 */
#define PORT14_PDISC_PDIS8_Msk                (0x100UL)                 /*!< PORT14 PDISC: PDIS8 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS9_Pos                (9UL)                     /*!< PORT14 PDISC: PDIS9 (Bit 9)                                 */
#define PORT14_PDISC_PDIS9_Msk                (0x200UL)                 /*!< PORT14 PDISC: PDIS9 (Bitfield-Mask: 0x01)                   */
#define PORT14_PDISC_PDIS10_Pos               (10UL)                    /*!< PORT14 PDISC: PDIS10 (Bit 10)                               */
#define PORT14_PDISC_PDIS10_Msk               (0x400UL)                 /*!< PORT14 PDISC: PDIS10 (Bitfield-Mask: 0x01)                  */
#define PORT14_PDISC_PDIS11_Pos               (11UL)                    /*!< PORT14 PDISC: PDIS11 (Bit 11)                               */
#define PORT14_PDISC_PDIS11_Msk               (0x800UL)                 /*!< PORT14 PDISC: PDIS11 (Bitfield-Mask: 0x01)                  */
#define PORT14_PDISC_PDIS12_Pos               (12UL)                    /*!< PORT14 PDISC: PDIS12 (Bit 12)                               */
#define PORT14_PDISC_PDIS12_Msk               (0x1000UL)                /*!< PORT14 PDISC: PDIS12 (Bitfield-Mask: 0x01)                  */
#define PORT14_PDISC_PDIS13_Pos               (13UL)                    /*!< PORT14 PDISC: PDIS13 (Bit 13)                               */
#define PORT14_PDISC_PDIS13_Msk               (0x2000UL)                /*!< PORT14 PDISC: PDIS13 (Bitfield-Mask: 0x01)                  */
#define PORT14_PDISC_PDIS14_Pos               (14UL)                    /*!< PORT14 PDISC: PDIS14 (Bit 14)                               */
#define PORT14_PDISC_PDIS14_Msk               (0x4000UL)                /*!< PORT14 PDISC: PDIS14 (Bitfield-Mask: 0x01)                  */
#define PORT14_PDISC_PDIS15_Pos               (15UL)                    /*!< PORT14 PDISC: PDIS15 (Bit 15)                               */
#define PORT14_PDISC_PDIS15_Msk               (0x8000UL)                /*!< PORT14 PDISC: PDIS15 (Bitfield-Mask: 0x01)                  */

/* ---------------------------------  PORT14_PPS  --------------------------------- */
#define PORT14_PPS_PPS0_Pos                   (0UL)                     /*!< PORT14 PPS: PPS0 (Bit 0)                                    */
#define PORT14_PPS_PPS0_Msk                   (0x1UL)                   /*!< PORT14 PPS: PPS0 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS1_Pos                   (1UL)                     /*!< PORT14 PPS: PPS1 (Bit 1)                                    */
#define PORT14_PPS_PPS1_Msk                   (0x2UL)                   /*!< PORT14 PPS: PPS1 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS2_Pos                   (2UL)                     /*!< PORT14 PPS: PPS2 (Bit 2)                                    */
#define PORT14_PPS_PPS2_Msk                   (0x4UL)                   /*!< PORT14 PPS: PPS2 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS3_Pos                   (3UL)                     /*!< PORT14 PPS: PPS3 (Bit 3)                                    */
#define PORT14_PPS_PPS3_Msk                   (0x8UL)                   /*!< PORT14 PPS: PPS3 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS4_Pos                   (4UL)                     /*!< PORT14 PPS: PPS4 (Bit 4)                                    */
#define PORT14_PPS_PPS4_Msk                   (0x10UL)                  /*!< PORT14 PPS: PPS4 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS5_Pos                   (5UL)                     /*!< PORT14 PPS: PPS5 (Bit 5)                                    */
#define PORT14_PPS_PPS5_Msk                   (0x20UL)                  /*!< PORT14 PPS: PPS5 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS6_Pos                   (6UL)                     /*!< PORT14 PPS: PPS6 (Bit 6)                                    */
#define PORT14_PPS_PPS6_Msk                   (0x40UL)                  /*!< PORT14 PPS: PPS6 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS7_Pos                   (7UL)                     /*!< PORT14 PPS: PPS7 (Bit 7)                                    */
#define PORT14_PPS_PPS7_Msk                   (0x80UL)                  /*!< PORT14 PPS: PPS7 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS8_Pos                   (8UL)                     /*!< PORT14 PPS: PPS8 (Bit 8)                                    */
#define PORT14_PPS_PPS8_Msk                   (0x100UL)                 /*!< PORT14 PPS: PPS8 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS9_Pos                   (9UL)                     /*!< PORT14 PPS: PPS9 (Bit 9)                                    */
#define PORT14_PPS_PPS9_Msk                   (0x200UL)                 /*!< PORT14 PPS: PPS9 (Bitfield-Mask: 0x01)                      */
#define PORT14_PPS_PPS10_Pos                  (10UL)                    /*!< PORT14 PPS: PPS10 (Bit 10)                                  */
#define PORT14_PPS_PPS10_Msk                  (0x400UL)                 /*!< PORT14 PPS: PPS10 (Bitfield-Mask: 0x01)                     */
#define PORT14_PPS_PPS11_Pos                  (11UL)                    /*!< PORT14 PPS: PPS11 (Bit 11)                                  */
#define PORT14_PPS_PPS11_Msk                  (0x800UL)                 /*!< PORT14 PPS: PPS11 (Bitfield-Mask: 0x01)                     */
#define PORT14_PPS_PPS12_Pos                  (12UL)                    /*!< PORT14 PPS: PPS12 (Bit 12)                                  */
#define PORT14_PPS_PPS12_Msk                  (0x1000UL)                /*!< PORT14 PPS: PPS12 (Bitfield-Mask: 0x01)                     */
#define PORT14_PPS_PPS13_Pos                  (13UL)                    /*!< PORT14 PPS: PPS13 (Bit 13)                                  */
#define PORT14_PPS_PPS13_Msk                  (0x2000UL)                /*!< PORT14 PPS: PPS13 (Bitfield-Mask: 0x01)                     */
#define PORT14_PPS_PPS14_Pos                  (14UL)                    /*!< PORT14 PPS: PPS14 (Bit 14)                                  */
#define PORT14_PPS_PPS14_Msk                  (0x4000UL)                /*!< PORT14 PPS: PPS14 (Bitfield-Mask: 0x01)                     */
#define PORT14_PPS_PPS15_Pos                  (15UL)                    /*!< PORT14 PPS: PPS15 (Bit 15)                                  */
#define PORT14_PPS_PPS15_Msk                  (0x8000UL)                /*!< PORT14 PPS: PPS15 (Bitfield-Mask: 0x01)                     */

/* --------------------------------  PORT14_HWSEL  -------------------------------- */
#define PORT14_HWSEL_HW0_Pos                  (0UL)                     /*!< PORT14 HWSEL: HW0 (Bit 0)                                   */
#define PORT14_HWSEL_HW0_Msk                  (0x3UL)                   /*!< PORT14 HWSEL: HW0 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW1_Pos                  (2UL)                     /*!< PORT14 HWSEL: HW1 (Bit 2)                                   */
#define PORT14_HWSEL_HW1_Msk                  (0xcUL)                   /*!< PORT14 HWSEL: HW1 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW2_Pos                  (4UL)                     /*!< PORT14 HWSEL: HW2 (Bit 4)                                   */
#define PORT14_HWSEL_HW2_Msk                  (0x30UL)                  /*!< PORT14 HWSEL: HW2 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW3_Pos                  (6UL)                     /*!< PORT14 HWSEL: HW3 (Bit 6)                                   */
#define PORT14_HWSEL_HW3_Msk                  (0xc0UL)                  /*!< PORT14 HWSEL: HW3 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW4_Pos                  (8UL)                     /*!< PORT14 HWSEL: HW4 (Bit 8)                                   */
#define PORT14_HWSEL_HW4_Msk                  (0x300UL)                 /*!< PORT14 HWSEL: HW4 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW5_Pos                  (10UL)                    /*!< PORT14 HWSEL: HW5 (Bit 10)                                  */
#define PORT14_HWSEL_HW5_Msk                  (0xc00UL)                 /*!< PORT14 HWSEL: HW5 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW6_Pos                  (12UL)                    /*!< PORT14 HWSEL: HW6 (Bit 12)                                  */
#define PORT14_HWSEL_HW6_Msk                  (0x3000UL)                /*!< PORT14 HWSEL: HW6 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW7_Pos                  (14UL)                    /*!< PORT14 HWSEL: HW7 (Bit 14)                                  */
#define PORT14_HWSEL_HW7_Msk                  (0xc000UL)                /*!< PORT14 HWSEL: HW7 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW8_Pos                  (16UL)                    /*!< PORT14 HWSEL: HW8 (Bit 16)                                  */
#define PORT14_HWSEL_HW8_Msk                  (0x30000UL)               /*!< PORT14 HWSEL: HW8 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW9_Pos                  (18UL)                    /*!< PORT14 HWSEL: HW9 (Bit 18)                                  */
#define PORT14_HWSEL_HW9_Msk                  (0xc0000UL)               /*!< PORT14 HWSEL: HW9 (Bitfield-Mask: 0x03)                     */
#define PORT14_HWSEL_HW10_Pos                 (20UL)                    /*!< PORT14 HWSEL: HW10 (Bit 20)                                 */
#define PORT14_HWSEL_HW10_Msk                 (0x300000UL)              /*!< PORT14 HWSEL: HW10 (Bitfield-Mask: 0x03)                    */
#define PORT14_HWSEL_HW11_Pos                 (22UL)                    /*!< PORT14 HWSEL: HW11 (Bit 22)                                 */
#define PORT14_HWSEL_HW11_Msk                 (0xc00000UL)              /*!< PORT14 HWSEL: HW11 (Bitfield-Mask: 0x03)                    */
#define PORT14_HWSEL_HW12_Pos                 (24UL)                    /*!< PORT14 HWSEL: HW12 (Bit 24)                                 */
#define PORT14_HWSEL_HW12_Msk                 (0x3000000UL)             /*!< PORT14 HWSEL: HW12 (Bitfield-Mask: 0x03)                    */
#define PORT14_HWSEL_HW13_Pos                 (26UL)                    /*!< PORT14 HWSEL: HW13 (Bit 26)                                 */
#define PORT14_HWSEL_HW13_Msk                 (0xc000000UL)             /*!< PORT14 HWSEL: HW13 (Bitfield-Mask: 0x03)                    */
#define PORT14_HWSEL_HW14_Pos                 (28UL)                    /*!< PORT14 HWSEL: HW14 (Bit 28)                                 */
#define PORT14_HWSEL_HW14_Msk                 (0x30000000UL)            /*!< PORT14 HWSEL: HW14 (Bitfield-Mask: 0x03)                    */
#define PORT14_HWSEL_HW15_Pos                 (30UL)                    /*!< PORT14 HWSEL: HW15 (Bit 30)                                 */
#define PORT14_HWSEL_HW15_Msk                 (0xc0000000UL)            /*!< PORT14 HWSEL: HW15 (Bitfield-Mask: 0x03)                    */



/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define PPB_BASE                        0xE000E000UL
#define DLR_BASE                        0x50004900UL
#define ERU0_BASE                       0x50004800UL
#define ERU1_BASE                       0x40044000UL
#define GPDMA0_BASE                     0x500142C0UL
#define GPDMA0_CH0_BASE                 0x50014000UL
#define GPDMA0_CH1_BASE                 0x50014058UL
#define GPDMA0_CH2_BASE                 0x500140B0UL
#define GPDMA0_CH3_BASE                 0x50014108UL
#define GPDMA0_CH4_BASE                 0x50014160UL
#define GPDMA0_CH5_BASE                 0x500141B8UL
#define GPDMA0_CH6_BASE                 0x50014210UL
#define GPDMA0_CH7_BASE                 0x50014268UL
#define FCE_BASE                        0x50020000UL
#define FCE_KE0_BASE                    0x50020020UL
#define FCE_KE1_BASE                    0x50020040UL
#define FCE_KE2_BASE                    0x50020060UL
#define FCE_KE3_BASE                    0x50020080UL
#define PBA0_BASE                       0x40000000UL
#define PBA1_BASE                       0x48000000UL
#define FLASH0_BASE                     0x58001000UL
#define PREF_BASE                       0x58004000UL
#define PMU0_BASE                       0x58000508UL
#define WDT_BASE                        0x50008000UL
#define RTC_BASE                        0x50004A00UL
#define SCU_CLK_BASE                    0x50004600UL
#define SCU_OSC_BASE                    0x50004700UL
#define SCU_PLL_BASE                    0x50004710UL
#define SCU_GENERAL_BASE                0x50004000UL
#define SCU_INTERRUPT_BASE              0x50004074UL
#define SCU_PARITY_BASE                 0x5000413CUL
#define SCU_TRAP_BASE                   0x50004160UL
#define SCU_HIBERNATE_BASE              0x50004300UL
#define SCU_POWER_BASE                  0x50004200UL
#define SCU_RESET_BASE                  0x50004400UL
#define LEDTS0_BASE                     0x48010000UL
#define USB0_BASE                       0x50040000UL
#define USB_EP_BASE                   0x50040900UL
#define USB0_EP1_BASE                   0x50040920UL
#define USB0_EP2_BASE                   0x50040940UL
#define USB0_EP3_BASE                   0x50040960UL
#define USB0_EP4_BASE                   0x50040980UL
#define USB0_EP5_BASE                   0x500409A0UL
#define USB0_EP6_BASE                   0x500409C0UL
#define USIC0_BASE                      0x40030008UL
#define USIC1_BASE                      0x48020008UL
#define USIC0_CH0_BASE                  0x40030000UL
#define USIC0_CH1_BASE                  0x40030200UL
#define USIC1_CH0_BASE                  0x48020000UL
#define USIC1_CH1_BASE                  0x48020200UL
#define CAN_BASE                        0x48014000UL
#define CAN_NODE0_BASE                  0x48014200UL
#define CAN_NODE1_BASE                  0x48014300UL
#define CAN_MO0_BASE                    0x48015000UL
#define CAN_MO1_BASE                    0x48015020UL
#define CAN_MO2_BASE                    0x48015040UL
#define CAN_MO3_BASE                    0x48015060UL
#define CAN_MO4_BASE                    0x48015080UL
#define CAN_MO5_BASE                    0x480150A0UL
#define CAN_MO6_BASE                    0x480150C0UL
#define CAN_MO7_BASE                    0x480150E0UL
#define CAN_MO8_BASE                    0x48015100UL
#define CAN_MO9_BASE                    0x48015120UL
#define CAN_MO10_BASE                   0x48015140UL
#define CAN_MO11_BASE                   0x48015160UL
#define CAN_MO12_BASE                   0x48015180UL
#define CAN_MO13_BASE                   0x480151A0UL
#define CAN_MO14_BASE                   0x480151C0UL
#define CAN_MO15_BASE                   0x480151E0UL
#define CAN_MO16_BASE                   0x48015200UL
#define CAN_MO17_BASE                   0x48015220UL
#define CAN_MO18_BASE                   0x48015240UL
#define CAN_MO19_BASE                   0x48015260UL
#define CAN_MO20_BASE                   0x48015280UL
#define CAN_MO21_BASE                   0x480152A0UL
#define CAN_MO22_BASE                   0x480152C0UL
#define CAN_MO23_BASE                   0x480152E0UL
#define CAN_MO24_BASE                   0x48015300UL
#define CAN_MO25_BASE                   0x48015320UL
#define CAN_MO26_BASE                   0x48015340UL
#define CAN_MO27_BASE                   0x48015360UL
#define CAN_MO28_BASE                   0x48015380UL
#define CAN_MO29_BASE                   0x480153A0UL
#define CAN_MO30_BASE                   0x480153C0UL
#define CAN_MO31_BASE                   0x480153E0UL
#define CAN_MO32_BASE                   0x48015400UL
#define CAN_MO33_BASE                   0x48015420UL
#define CAN_MO34_BASE                   0x48015440UL
#define CAN_MO35_BASE                   0x48015460UL
#define CAN_MO36_BASE                   0x48015480UL
#define CAN_MO37_BASE                   0x480154A0UL
#define CAN_MO38_BASE                   0x480154C0UL
#define CAN_MO39_BASE                   0x480154E0UL
#define CAN_MO40_BASE                   0x48015500UL
#define CAN_MO41_BASE                   0x48015520UL
#define CAN_MO42_BASE                   0x48015540UL
#define CAN_MO43_BASE                   0x48015560UL
#define CAN_MO44_BASE                   0x48015580UL
#define CAN_MO45_BASE                   0x480155A0UL
#define CAN_MO46_BASE                   0x480155C0UL
#define CAN_MO47_BASE                   0x480155E0UL
#define CAN_MO48_BASE                   0x48015600UL
#define CAN_MO49_BASE                   0x48015620UL
#define CAN_MO50_BASE                   0x48015640UL
#define CAN_MO51_BASE                   0x48015660UL
#define CAN_MO52_BASE                   0x48015680UL
#define CAN_MO53_BASE                   0x480156A0UL
#define CAN_MO54_BASE                   0x480156C0UL
#define CAN_MO55_BASE                   0x480156E0UL
#define CAN_MO56_BASE                   0x48015700UL
#define CAN_MO57_BASE                   0x48015720UL
#define CAN_MO58_BASE                   0x48015740UL
#define CAN_MO59_BASE                   0x48015760UL
#define CAN_MO60_BASE                   0x48015780UL
#define CAN_MO61_BASE                   0x480157A0UL
#define CAN_MO62_BASE                   0x480157C0UL
#define CAN_MO63_BASE                   0x480157E0UL
#define VADC_BASE                       0x40004000UL
#define VADC_G0_BASE                    0x40004400UL
#define VADC_G1_BASE                    0x40004800UL
#define DAC_BASE                        0x48018000UL
#define CCU40_BASE                      0x4000C000UL
#define CCU41_BASE                      0x40010000UL
#define CCU40_CC40_BASE                 0x4000C100UL
#define CCU40_CC41_BASE                 0x4000C200UL
#define CCU40_CC42_BASE                 0x4000C300UL
#define CCU40_CC43_BASE                 0x4000C400UL
#define CCU41_CC40_BASE                 0x40010100UL
#define CCU41_CC41_BASE                 0x40010200UL
#define CCU41_CC42_BASE                 0x40010300UL
#define CCU41_CC43_BASE                 0x40010400UL
#define CCU80_BASE                      0x40020000UL
#define CCU80_CC80_BASE                 0x40020100UL
#define CCU80_CC81_BASE                 0x40020200UL
#define CCU80_CC82_BASE                 0x40020300UL
#define CCU80_CC83_BASE                 0x40020400UL
#define HRPWM0_BASE                     0x40020900UL
#define HRPWM0_CSG0_BASE                0x40020A00UL
#define HRPWM0_CSG1_BASE                0x40020B00UL
#define HRPWM0_CSG2_BASE                0x40020C00UL
#define HRPWM0_HRC0_BASE                0x40021300UL
#define HRPWM0_HRC1_BASE                0x40021400UL
#define HRPWM0_HRC2_BASE                0x40021500UL
#define HRPWM0_HRC3_BASE                0x40021600UL
#define POSIF0_BASE                     0x40028000UL
#define PORT0_BASE                      0x48028000UL
#define PORT1_BASE                      0x48028100UL
#define PORT2_BASE                      0x48028200UL
#define PORT3_BASE                      0x48028300UL
#define PORT14_BASE                     0x48028E00UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

