MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4108-Q48K64/mcu.h
#define PPB                             ((PPB_Type                *) PPB_BASE)
#define DLR                             ((DLR_GLOBAL_TypeDef                *) DLR_BASE)
#define ERU0                            ((ERU_GLOBAL_TypeDef                *) ERU0_BASE)
#define ERU1                            ((ERU_GLOBAL_TypeDef                *) ERU1_BASE)
#define GPDMA0                          ((GPDMA0_GLOBAL_TypeDef             *) GPDMA0_BASE)
#define GPDMA0_CH0                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH0_BASE)
#define GPDMA0_CH1                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH1_BASE)
#define GPDMA0_CH2                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH2_BASE)
#define GPDMA0_CH3                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH3_BASE)
#define GPDMA0_CH4                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH4_BASE)
#define GPDMA0_CH5                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH5_BASE)
#define GPDMA0_CH6                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH6_BASE)
#define GPDMA0_CH7                      ((GPDMA0_CH_TypeDef          *) GPDMA0_CH7_BASE)
#define FCE                             ((FCE_GLOBAL_TypeDef                *) FCE_BASE)
#define FCE_KE0                         ((FCE_KE_TypeDef             *) FCE_KE0_BASE)
#define FCE_KE1                         ((FCE_KE_TypeDef             *) FCE_KE1_BASE)
#define FCE_KE2                         ((FCE_KE_TypeDef             *) FCE_KE2_BASE)
#define FCE_KE3                         ((FCE_KE_TypeDef             *) FCE_KE3_BASE)
#define PBA0                            ((PBA_GLOBAL_TypeDef                *) PBA0_BASE)
#define PBA1                            ((PBA_GLOBAL_TypeDef                *) PBA1_BASE)
#define FLASH0                          ((FLASH0_GLOBAL_TypeDef              *) FLASH0_BASE)
#define PREF                            ((PREF_GLOBAL_TypeDef               *) PREF_BASE)
#define PMU0                            ((PMU0_GLOBAL_TypeDef                *) PMU0_BASE)
#define WDT                             ((WDT_GLOBAL_TypeDef                *) WDT_BASE)
#define RTC                             ((RTC_GLOBAL_TypeDef                *) RTC_BASE)
#define SCU_CLK                         ((SCU_CLK_TypeDef            *) SCU_CLK_BASE)
#define SCU_OSC                         ((SCU_OSC_TypeDef            *) SCU_OSC_BASE)
#define SCU_PLL                         ((SCU_PLL_TypeDef            *) SCU_PLL_BASE)
#define SCU_GENERAL                     ((SCU_GENERAL_TypeDef        *) SCU_GENERAL_BASE)
#define SCU_INTERRUPT                   ((SCU_INTERRUPT_TypeDef      *) SCU_INTERRUPT_BASE)
#define SCU_PARITY                      ((SCU_PARITY_TypeDef         *) SCU_PARITY_BASE)
#define SCU_TRAP                        ((SCU_TRAP_TypeDef           *) SCU_TRAP_BASE)
#define SCU_HIBERNATE                   ((SCU_HIBERNATE_TypeDef      *) SCU_HIBERNATE_BASE)
#define SCU_POWER                       ((SCU_POWER_TypeDef          *) SCU_POWER_BASE)
#define SCU_RESET                       ((SCU_RESET_TypeDef          *) SCU_RESET_BASE)
#define USIC0                           ((USIC_GLOBAL_TypeDef               *) USIC0_BASE)
#define USIC1                           ((USIC_GLOBAL_TypeDef               *) USIC1_BASE)
#define USIC0_CH0                       ((USIC_CH_TypeDef            *) USIC0_CH0_BASE)
#define USIC0_CH1                       ((USIC_CH_TypeDef            *) USIC0_CH1_BASE)
#define USIC1_CH0                       ((USIC_CH_TypeDef            *) USIC1_CH0_BASE)
#define USIC1_CH1                       ((USIC_CH_TypeDef            *) USIC1_CH1_BASE)
#define CAN                             ((CAN_GLOBAL_TypeDef                *) CAN_BASE)
#define CAN_NODE0                       ((CAN_NODE_TypeDef           *) CAN_NODE0_BASE)
#define CAN_MO0                         ((CAN_MO_TypeDef             *) CAN_MO0_BASE)
#define CAN_MO1                         ((CAN_MO_TypeDef             *) CAN_MO1_BASE)
#define CAN_MO2                         ((CAN_MO_TypeDef             *) CAN_MO2_BASE)
#define CAN_MO3                         ((CAN_MO_TypeDef             *) CAN_MO3_BASE)
#define CAN_MO4                         ((CAN_MO_TypeDef             *) CAN_MO4_BASE)
#define CAN_MO5                         ((CAN_MO_TypeDef             *) CAN_MO5_BASE)
#define CAN_MO6                         ((CAN_MO_TypeDef             *) CAN_MO6_BASE)
#define CAN_MO7                         ((CAN_MO_TypeDef             *) CAN_MO7_BASE)
#define CAN_MO8                         ((CAN_MO_TypeDef             *) CAN_MO8_BASE)
#define CAN_MO9                         ((CAN_MO_TypeDef             *) CAN_MO9_BASE)
#define CAN_MO10                        ((CAN_MO_TypeDef             *) CAN_MO10_BASE)
#define CAN_MO11                        ((CAN_MO_TypeDef             *) CAN_MO11_BASE)
#define CAN_MO12                        ((CAN_MO_TypeDef             *) CAN_MO12_BASE)
#define CAN_MO13                        ((CAN_MO_TypeDef             *) CAN_MO13_BASE)
#define CAN_MO14                        ((CAN_MO_TypeDef             *) CAN_MO14_BASE)
#define CAN_MO15                        ((CAN_MO_TypeDef             *) CAN_MO15_BASE)
#define CAN_MO16                        ((CAN_MO_TypeDef             *) CAN_MO16_BASE)
#define CAN_MO17                        ((CAN_MO_TypeDef             *) CAN_MO17_BASE)
#define CAN_MO18                        ((CAN_MO_TypeDef             *) CAN_MO18_BASE)
#define CAN_MO19                        ((CAN_MO_TypeDef             *) CAN_MO19_BASE)
#define CAN_MO20                        ((CAN_MO_TypeDef             *) CAN_MO20_BASE)
#define CAN_MO21                        ((CAN_MO_TypeDef             *) CAN_MO21_BASE)
#define CAN_MO22                        ((CAN_MO_TypeDef             *) CAN_MO22_BASE)
#define CAN_MO23                        ((CAN_MO_TypeDef             *) CAN_MO23_BASE)
#define CAN_MO24                        ((CAN_MO_TypeDef             *) CAN_MO24_BASE)
#define CAN_MO25                        ((CAN_MO_TypeDef             *) CAN_MO25_BASE)
#define CAN_MO26                        ((CAN_MO_TypeDef             *) CAN_MO26_BASE)
#define CAN_MO27                        ((CAN_MO_TypeDef             *) CAN_MO27_BASE)
#define CAN_MO28                        ((CAN_MO_TypeDef             *) CAN_MO28_BASE)
#define CAN_MO29                        ((CAN_MO_TypeDef             *) CAN_MO29_BASE)
#define CAN_MO30                        ((CAN_MO_TypeDef             *) CAN_MO30_BASE)
#define CAN_MO31                        ((CAN_MO_TypeDef             *) CAN_MO31_BASE)
#define VADC                            ((VADC_GLOBAL_TypeDef               *) VADC_BASE)
#define VADC_G0                         ((VADC_G_TypeDef             *) VADC_G0_BASE)
#define VADC_G1                         ((VADC_G_TypeDef             *) VADC_G1_BASE)
#define DAC                             ((DAC_GLOBAL_TypeDef                *) DAC_BASE)
#define CCU40                           ((CCU4_GLOBAL_TypeDef               *) CCU40_BASE)
#define CCU41                           ((CCU4_GLOBAL_TypeDef               *) CCU41_BASE)
#define CCU40_CC40                      ((CCU4_CC4_TypeDef           *) CCU40_CC40_BASE)
#define CCU40_CC41                      ((CCU4_CC4_TypeDef           *) CCU40_CC41_BASE)
#define CCU40_CC42                      ((CCU4_CC4_TypeDef           *) CCU40_CC42_BASE)
#define CCU40_CC43                      ((CCU4_CC4_TypeDef           *) CCU40_CC43_BASE)
#define CCU41_CC40                      ((CCU4_CC4_TypeDef           *) CCU41_CC40_BASE)
#define CCU41_CC41                      ((CCU4_CC4_TypeDef           *) CCU41_CC41_BASE)
#define CCU41_CC42                      ((CCU4_CC4_TypeDef           *) CCU41_CC42_BASE)
#define CCU41_CC43                      ((CCU4_CC4_TypeDef           *) CCU41_CC43_BASE)
#define CCU80                           ((CCU8_GLOBAL_TypeDef               *) CCU80_BASE)
#define CCU80_CC80                      ((CCU8_CC8_TypeDef           *) CCU80_CC80_BASE)
#define CCU80_CC81                      ((CCU8_CC8_TypeDef           *) CCU80_CC81_BASE)
#define CCU80_CC82                      ((CCU8_CC8_TypeDef           *) CCU80_CC82_BASE)
#define CCU80_CC83                      ((CCU8_CC8_TypeDef           *) CCU80_CC83_BASE)
#define POSIF0                          ((POSIF_GLOBAL_TypeDef              *) POSIF0_BASE)
#define PORT0                           ((PORT0_Type              *) PORT0_BASE)
#define PORT1                           ((PORT1_Type              *) PORT1_BASE)
#define PORT2                           ((PORT2_Type              *) PORT2_BASE)
#define PORT3                           ((PORT3_Type              *) PORT3_BASE)
#define PORT14                          ((PORT14_Type             *) PORT14_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group XMC4108 */
/** @} */ /* End of group Infineon */

#ifdef __cplusplus
}
#endif


#endif  /* XMC4108_H */

